RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/bl808_glb.h
/**
  ******************************************************************************
  * @file    bl808_glb.h
  * @version V1.0
  * @date
  * @brief   This file is the standard driver header file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __BL808_GLB_H__
#define __BL808_GLB_H__

#include "glb_reg.h"
#include "cci_reg.h"
#include "mm_glb_reg.h"
#include "pds_reg.h"
#include "bl808_gpio.h"
#include "bl808_hbn.h"
#include "bl808_aon.h"
#include "bl808_pds.h"
#include "bl808_common.h"
#include "bflb_sf_ctrl.h"
#include "bflb_sf_cfg.h"

/** @addtogroup  BL808_Peripheral_Driver
 *  @{
 */

/** @addtogroup  GLB
 *  @{
 */

/** @defgroup  GLB_Public_Types
 *  @{
 */

/**
 *  @brief GLB AHB clock IP type definition
 */
typedef enum {
    GLB_AHB_CLOCK_IP_CPU,
    GLB_AHB_CLOCK_IP_SDU,
    GLB_AHB_CLOCK_IP_SEC,
    GLB_AHB_CLOCK_IP_DMA_0,
    GLB_AHB_CLOCK_IP_DMA_1,
    GLB_AHB_CLOCK_IP_DMA_2,
    GLB_AHB_CLOCK_IP_CCI,
    GLB_AHB_CLOCK_IP_RF_TOP,
    GLB_AHB_CLOCK_IP_GPIP,
    GLB_AHB_CLOCK_IP_TZC,
    GLB_AHB_CLOCK_IP_EF_CTRL,
    GLB_AHB_CLOCK_IP_SF_CTRL,
    GLB_AHB_CLOCK_IP_EMAC,
    GLB_AHB_CLOCK_IP_UART0,
    GLB_AHB_CLOCK_IP_UART1,
    GLB_AHB_CLOCK_IP_UART2,
    GLB_AHB_CLOCK_IP_UART3,
    GLB_AHB_CLOCK_IP_SPI,
    GLB_AHB_CLOCK_IP_I2C,
    GLB_AHB_CLOCK_IP_PWM,
    GLB_AHB_CLOCK_IP_TIMER,
    GLB_AHB_CLOCK_IP_IR,
    GLB_AHB_CLOCK_IP_CHECKSUM,
    GLB_AHB_CLOCK_IP_QDEC,
    GLB_AHB_CLOCK_IP_KYS,
    GLB_AHB_CLOCK_IP_I2S,
    GLB_AHB_CLOCK_IP_USB11,
    GLB_AHB_CLOCK_IP_CAM,
    GLB_AHB_CLOCK_IP_MJPEG,
    GLB_AHB_CLOCK_IP_BT_BLE_NORMAL,
    GLB_AHB_CLOCK_IP_BT_BLE_LP,
    GLB_AHB_CLOCK_IP_ZB_NORMAL,
    GLB_AHB_CLOCK_IP_ZB_LP,
    GLB_AHB_CLOCK_IP_WIFI_NORMAL,
    GLB_AHB_CLOCK_IP_WIFI_LP,
    GLB_AHB_CLOCK_IP_BT_BLE_2_NORMAL,
    GLB_AHB_CLOCK_IP_BT_BLE_2_LP,
    GLB_AHB_CLOCK_IP_EMI_MISC,
    GLB_AHB_CLOCK_IP_PSRAM0_CTRL,
    GLB_AHB_CLOCK_IP_PSRAM1_CTRL,
    GLB_AHB_CLOCK_IP_USB20,
    GLB_AHB_CLOCK_IP_MIX2,
    GLB_AHB_CLOCK_IP_AUDIO,
    GLB_AHB_CLOCK_IP_SDH,
    GLB_AHB_CLOCK_IP_ZB2_NORMAL,
    GLB_AHB_CLOCK_IP_ZB2_LP,
    GLB_AHB_CLOCK_IP_I2C1,
    GLB_AHB_CLOCK_IP_WIFI_PHY,
    GLB_AHB_CLOCK_IP_WIFI_MAC_PHY,
    GLB_AHB_CLOCK_IP_WIFI_PLATFORM,
    GLB_AHB_CLOCK_IP_LZ4,
    GLB_AHB_CLOCK_IP_AUPDM,
    GLB_AHB_CLOCK_IP_GAUGE,
} GLB_AHB_CLOCK_IP_Type;

/**
 *  @brief GLB core ID type definition
 */
typedef enum {
    GLB_CORE_ID_M0,      /*!< M0 */
    GLB_CORE_ID_D0,      /*!< D0 */
    GLB_CORE_ID_LP,      /*!< LP */
    GLB_CORE_ID_MAX,     /*!< ID max */
    GLB_CORE_ID_INVALID, /*!< ID invalid */
} GLB_CORE_ID_Type;

/**
 *  @brief cci ID type definition
 */
typedef enum {
    CCI0_ID,    /*!< CCI0 port define */
    CCI_ID_MAX, /*!< CCI MAX ID define */
} CCI_ID_Type;

/**
 *  @brief GLB DSP all interrupt type definition
 */
typedef enum {
    GLB_DSP_ALL_INT_BUS_DEC_ERR_INT = 0,      /*!< bus_dec_err_int */
    GLB_DSP_ALL_INT_RSV1_INT = 1,             /*!< rsv1 */
    GLB_DSP_ALL_INT_IPC2_NP2AP_IRQ = 2,       /*!< |ipc2_np2ap_irq */
    GLB_DSP_ALL_INT_RSV3 = 3,                 /*!< rsv3 */
    GLB_DSP_ALL_INT_UART0_INT = 4,            /*!< uart0_int */
    GLB_DSP_ALL_INT_I2C0_INT = 5,             /*!< i2c0_int */
    GLB_DSP_ALL_INT_I2C1_INT = 6,             /*!< i2c1_int */
    GLB_DSP_ALL_INT_SPI_INT = 7,              /*!< spi_int */
    GLB_DSP_ALL_INT_RSV4_INT = 8,             /*!< rsv4 */
    GLB_DSP_ALL_INT_RSV5_INT = 9,             /*!< rsv5 */
    GLB_DSP_ALL_INT_SEOF1_INT = 10,           /*!< seof1_int */
    GLB_DSP_ALL_INT_SEOF2_INT = 11,           /*!< seof2_int */
    GLB_DSP_ALL_INT_SEOF3_INT = 12,           /*!< seof3_int */
    GLB_DSP_ALL_INT_DVP2BUS_INT_0 = 13,       /*!< dvp2bus_int[0] */
    GLB_DSP_ALL_INT_DVP2BUS_INT_1 = 14,       /*!< dvp2bus_int[1] */
    GLB_DSP_ALL_INT_DVP2BUS_INT_2 = 15,       /*!< dvp2bus_int[2] */
    GLB_DSP_ALL_INT_DVP2BUS_INT_3 = 16,       /*!< dvp2bus_int[3] */
    GLB_DSP_ALL_INT_H264_BS_IRQ = 17,         /*!< h264_bs_irq */
    GLB_DSP_ALL_INT_H264_FRAME_IRQ = 18,      /*!< h264_frame_irq */
    GLB_DSP_ALL_INT_H264_SEQ_DONE_INT = 19,   /*!< h264_seq_done_int */
    GLB_DSP_ALL_INT_MJPEG_INT = 20,           /*!< mjpeg_int */
    GLB_DSP_ALL_INT_H264_S_BS_IRQ = 21,       /*!< h264_s_bs_irq */
    GLB_DSP_ALL_INT_H264_S_FRAME_IRQ = 22,    /*!< h264_s_frame_irq */
    GLB_DSP_ALL_INT_H264_S_SEQ_DONE_INT = 23, /*!< h264_s_seq_done_int */
    GLB_DSP_ALL_INT_DMA_INTR_0 = 24,          /*!< DMA_INTR[0] */
    GLB_DSP_ALL_INT_DMA_INTR_1 = 25,          /*!< DMA_INTR[1] */
    GLB_DSP_ALL_INT_DMA_INTR_2 = 26,          /*!< DMA_INTR[2] */
    GLB_DSP_ALL_INT_DMA_INTR_3 = 27,          /*!< DMA_INTR[3] */
    GLB_DSP_ALL_INT_DMA_INTR_4 = 28,          /*!< DMA_INTR[4] */
    GLB_DSP_ALL_INT_DMA_INTR_5 = 29,          /*!< DMA_INTR[5] */
    GLB_DSP_ALL_INT_DMA_INTR_6 = 30,          /*!< DMA_INTR[6] */
    GLB_DSP_ALL_INT_DMA_INTR_7 = 31,          /*!< DMA_INTR[7] */
    GLB_DSP_ALL_INT_RSV32 = 32,               /*!< rsv32 */
    GLB_DSP_ALL_INT_RSV33 = 33,               /*!< rsv33 */
    GLB_DSP_ALL_INT_RSV34 = 34,               /*!< rsv34 */
    GLB_DSP_ALL_INT_RSV35 = 35,               /*!< rsv35 */
    GLB_DSP_ALL_INT_RSV36 = 36,               /*!< rsv36 */
    GLB_DSP_ALL_INT_MIPI_CSI_INT = 37,        /*!< mipi_csi_int */
    GLB_DSP_ALL_INT_IPC2_AP2NP_IRQ = 38,      /*!< |ipc2_ap2np_irq */
    GLB_DSP_ALL_INT_RSV39 = 39,               /*!< rsv39 */
    GLB_DSP_ALL_INT_MJDEC_INT = 40,           /*!< mjdec_int */
    GLB_DSP_ALL_INT_DVP2BUS_IN_4 = 41,        /*!< dvp2bus_int[4] */
    GLB_DSP_ALL_INT_DVP2BUS_IN_5 = 42,        /*!< dvp2bus_int[5] */
    GLB_DSP_ALL_INT_DVP2BUS_IN_6 = 43,        /*!< dvp2bus_int[6] */
    GLB_DSP_ALL_INT_DVP2BUS_IN_7 = 44,        /*!< dvp2bus_int[7] */
    GLB_DSP_ALL_INT_DMA2D_INT_0 = 45,         /*!< dma2d_int[0] */
    GLB_DSP_ALL_INT_DMA2D_INT_1 = 46,         /*!< dma2d_int[1] */
    GLB_DSP_ALL_INT_DP_SOEF0_INT = 47,        /*!< dp_soef0_int */
    GLB_DSP_ALL_INT_RSV48 = 48,               /*!< rsv48 */
    GLB_DSP_ALL_INT_RSV49 = 49,               /*!< rsv49 */
    GLB_DSP_ALL_INT_RSV50 = 50,               /*!< rsv50 */
    GLB_DSP_ALL_INT_RSV51 = 51,               /*!< rsv51 */
    GLB_DSP_ALL_INT_OSDDP_INT = 52,           /*!< osdDP_int */
    GLB_DSP_ALL_INT_DBI_INT = 53,             /*!< dbi_int */
    GLB_DSP_ALL_INT_RSV6_INT = 54,            /*!< rsv6 */
    GLB_DSP_ALL_INT_OSDA_INT = 55,            /*!< osdA_int */
    GLB_DSP_ALL_INT_OSDB_INT = 56,            /*!< osdB_int */
    GLB_DSP_ALL_INT_OSD_PB_INT = 57,          /*!< osd_pb_int */
    GLB_DSP_ALL_INT_RSV7_INT = 58,            /*!< rsv7 */
    GLB_DSP_ALL_INT_MIPI_DSI_INT = 59,        /*!< mipi_dsi_int */
    GLB_DSP_ALL_INT_RSV8_INT = 60,            /*!< rsv8 */
    GLB_DSP_ALL_INT_MM_TIMER_IRQ2 = 61,       /*!< mm_timer_irq2 */
    GLB_DSP_ALL_INT_MM_TIMER_IRQ3 = 62,       /*!< mm_timer_irq3 */
    GLB_DSP_ALL_INT_MM_WDT_IRQ = 63,          /*!< mm_wdt_irq */
} GLB_DSP_ALL_INT_Type;

/**
 *  @brief GLB MCU all interrupt type definition
 */
typedef enum {
    GLB_MCU_ALL_INT_BMX_ERR_INT = 0,                       /*!< bmx_err_intmcu_dec_err_int */
    GLB_MCU_ALL_INT_BMX_TIMEOUT_INT_MCU_TIMEOUT_INT = 1,   /*!< bmx_timeout_intmcu_timeout_int */
    GLB_MCU_ALL_INT_IPC0_NP2AP_IRQ = 2,                    /*!< ipc0_np2ap_irq */
    GLB_MCU_ALL_INT_IPC0_AP2NP_IRQ = 3,                    /*!< ipc0_ap2np_irq */
    GLB_MCU_ALL_INT_AUDIO_INT = 4,                         /*!< audio_int */
    GLB_MCU_ALL_INT_RF_TOP_INT_0 = 5,                      /*!< rf_top_int[0] */
    GLB_MCU_ALL_INT_RF_TOP_INT_1 = 6,                      /*!< rf_top_int[1] */
    GLB_MCU_ALL_INT_LZ4_INT = 7,                           /*!< lz4_int */
    GLB_MCU_ALL_INT_RSV8 = 8,                              /*!< rsv8 */
    GLB_MCU_ALL_INT_SEC_ENG_ID0_GMAC_INT = 9,              /*!< sec_eng_id0_gmac_int */
    GLB_MCU_ALL_INT_SEC_ENG_ID0_CDET_INT = 10,             /*!< sec_eng_id0_cdet_int */
    GLB_MCU_ALL_INT_SEC_ENG_ID0_PKA_INT = 11,              /*!< sec_eng_id0_pka_int */
    GLB_MCU_ALL_INT_SEC_ENG_ID0_TRNG_INT = 12,             /*!< sec_eng_id0_trng_int */
    GLB_MCU_ALL_INT_SEC_ENG_ID0_AES_INT = 13,              /*!< sec_eng_id0_aes_int */
    GLB_MCU_ALL_INT_SEC_ENG_ID0_SHA_INT = 14,              /*!< sec_eng_id0_sha_int */
    GLB_MCU_ALL_INT_DMA_INTR_ALL = 15,                     /*!< DMA_INTR_ALL */
    GLB_MCU_ALL_INT_DMA2_INTR_ALL = 16,                    /*!< DMA2_INTR_ALL */
    GLB_MCU_ALL_INT_SDH_MMC1_INT_SDH2PMU_WAKEUP_INT1 = 17, /*!< sdh_mmc1_intsdh2pmu_wakeup_int1 */
    GLB_MCU_ALL_INT_MM_IRQ_ALL = 18,                       /*!< mm_irq_all */
    GLB_MCU_ALL_INT_IRTX_INT = 19,                         /*!< irtx_int */
    GLB_MCU_ALL_INT_IRRX_INT = 20,                         /*!< irrx_int */
    GLB_MCU_ALL_INT_USB_INT = 21,                          /*!< usb_int */
    GLB_MCU_ALL_INT_AUPDM_INT = 22,                        /*!< aupdm_int */
    GLB_MCU_ALL_INT_SF_CTRL_ID0_INT = 23,                  /*!< sf_ctrl_id0_int */
    GLB_MCU_ALL_INT_EMAC_INT = 24,                         /*!< emac_int */
    GLB_MCU_ALL_INT_GPADC_DMA_INT = 25,                    /*!< gpadc_dma_int */
    GLB_MCU_ALL_INT_EFUSE_INT = 26,                        /*!< efuse_int */
    GLB_MCU_ALL_INT_SPI_0_INT = 27,                        /*!< spi_0_int */
    GLB_MCU_ALL_INT_UART_IRQ = 28,                         /*!< uart_irq */
    GLB_MCU_ALL_INT_UART1_IRQ = 29,                        /*!< uart1_irq */
    GLB_MCU_ALL_INT_UART2_IRQ = 30,                        /*!< uart2_irq */
    GLB_MCU_ALL_INT_GPIO_DMA_INT = 31,                     /*!< gpio_dma_int */
    GLB_MCU_ALL_INT_I2C_0_INT = 32,                        /*!< i2c_0_int */
    GLB_MCU_ALL_INT_PWM_INT = 33,                          /*!< pwm_int */
    GLB_MCU_ALL_INT_IPC1_NP2AP_IRQ = 34,                   /*!< ipc1_np2ap_irq */
    GLB_MCU_ALL_INT_IPC1_AP2NP_IRQ = 35,                   /*!< ipc1_ap2np_irq */
    GLB_MCU_ALL_INT_TIMER0_2_IRQ = 36,                     /*!< timer0_2_irq */
    GLB_MCU_ALL_INT_TIMER0_3_IRQ = 37,                     /*!< timer0_3_irq */
    GLB_MCU_ALL_INT_WDT0_IRQ = 38,                         /*!< wdt0_irq */
    GLB_MCU_ALL_INT_I2C_1_INT = 39,                        /*!< i2c_1_int */
    GLB_MCU_ALL_INT_I2S0_INT = 40,                         /*!< i2s0_int */
    GLB_MCU_ALL_INT_RSV41 = 41,                            /*!< rsv41 */
    GLB_MCU_ALL_INT_RSV42 = 42,                            /*!< rsv42 */
    GLB_MCU_ALL_INT_ANA_OCP_OUT_TO_CPU_IRQ = 43,           /*!< ana_ocp_out_to_cpu_irq[2:0] */
    GLB_MCU_ALL_INT_GPIO_IRQ = 44,                         /*!< gpio_irq */
    GLB_MCU_ALL_INT_DM_IRQ = 45,                           /*!< dm_irq */
    GLB_MCU_ALL_INT_BT_IRQ = 46,                           /*!< bt_irq */
    GLB_MCU_ALL_INT_M154_REQ_ENH_ACK_INT = 47,             /*!< m154_req_enh_ack_int */
    GLB_MCU_ALL_INT_M154_INT = 48,                         /*!< m154_int */
    GLB_MCU_ALL_INT_M154_AES_INT = 49,                     /*!< m154_aes_int */
    GLB_MCU_ALL_INT_PDS_INT = 50,                          /*!< pds_int */
    GLB_MCU_ALL_INT_HBN_IRQ_OUT_0 = 51,                    /*!< hbn_irq_out[0] */
    GLB_MCU_ALL_INT_HBN_IRQ_OUT_1 = 52,                    /*!< hbn_irq_out[1] */
    GLB_MCU_ALL_INT_BOR_OUT = 53,                          /*!< bor_out */
    GLB_MCU_ALL_INT_WIFI_TO_CPU_IRQ_N = 54,                /*!< wifi_to_cpu_irq_n */
    GLB_MCU_ALL_INT_BZ_PHY_INT = 55,                       /*!< bz_phy_int */
    GLB_MCU_ALL_INT_BLE_INT = 56,                          /*!< ble_int */
    GLB_MCU_ALL_INT_MAC_INT_TX_RX_TIMER = 57,              /*!< mac_int_tx_rx_timer */
    GLB_MCU_ALL_INT_MAC_INT_TX_RX_MISC = 58,               /*!< mac_int_tx_rx_misc */
    GLB_MCU_ALL_INT_MAC_INT_RX_TRIGGER = 59,               /*!< mac_int_rx_trigger */
    GLB_MCU_ALL_INT_MAC_INT_TX_TRIGGER = 60,               /*!< mac_int_tx_trigger */
    GLB_MCU_ALL_INT_MAC_INT_GEN = 61,                      /*!< mac_int_gen */
    GLB_MCU_ALL_INT_MAC_INT_PROT_TRIGGER = 62,             /*!< mac_int_prot_trigger */
    GLB_MCU_ALL_INT_WIFI_IPC = 63,                         /*!< wifi_ipc */
} GLB_MCU_ALL_INT_Type;

/**
 *  @brief GLB LP all interrupt type definition
 */
typedef enum {
    GLB_LP_ALL_INT_BMX_ERR_INT = 0,                       /*!< bmx_err_int */
    GLB_LP_ALL_INT_BMX_TIMEOUT_INT_MCU_TIMEOUT_INT = 1,   /*!< bmx_timeout_intmcu_timeout_int */
    GLB_LP_ALL_INT_IPC0_NP2AP_IRQ = 2,                    /*!< ipc0_np2ap_irq */
    GLB_LP_ALL_INT_IPC0_AP2NP_IRQ = 3,                    /*!< ipc0_ap2np_irq */
    GLB_LP_ALL_INT_AUDIO_INT = 4,                         /*!< audio_int */
    GLB_LP_ALL_INT_RF_TOP_INT_0 = 5,                      /*!< rf_top_int[0] */
    GLB_LP_ALL_INT_RF_TOP_INT_1 = 6,                      /*!< rf_top_int[1] */
    GLB_LP_ALL_INT_LZ4_INT = 7,                           /*!< lz4_int */
    GLB_LP_ALL_INT_RSV8 = 8,                              /*!< rsv8 */
    GLB_LP_ALL_INT_SEC_ENG_ID0_GMAC_INT = 9,              /*!< sec_eng_id0_gmac_int */
    GLB_LP_ALL_INT_SEC_ENG_ID0_CDET_INT = 10,             /*!< sec_eng_id0_cdet_int */
    GLB_LP_ALL_INT_SEC_ENG_ID0_PKA_INT = 11,              /*!< sec_eng_id0_pka_int */
    GLB_LP_ALL_INT_SEC_ENG_ID0_TRNG_INT = 12,             /*!< sec_eng_id0_trng_int */
    GLB_LP_ALL_INT_SEC_ENG_ID0_AES_INT = 13,              /*!< sec_eng_id0_aes_int */
    GLB_LP_ALL_INT_SEC_ENG_ID0_SHA_INT = 14,              /*!< sec_eng_id0_sha_int */
    GLB_LP_ALL_INT_DMA_INTR_ALL = 15,                     /*!< DMA_INTR_ALL */
    GLB_LP_ALL_INT_DMA2_INTR_ALL = 16,                    /*!< DMA2_INTR_ALL */
    GLB_LP_ALL_INT_SDH_MMC1_INT_SDH2PMU_WAKEUP_INT1 = 17, /*!< sdh_mmc1_intsdh2pmu_wakeup_int1 */
    GLB_LP_ALL_INT_MM_IRQ_ALL = 18,                       /*!< mm_irq_all */
    GLB_LP_ALL_INT_IRTX_INT = 19,                         /*!< irtx_int */
    GLB_LP_ALL_INT_IRRX_INT = 20,                         /*!< irrx_int */
    GLB_LP_ALL_INT_USB_INT = 21,                          /*!< usb_int */
    GLB_LP_ALL_INT_AUPDM_INT = 22,                        /*!< aupdm_int */
    GLB_LP_ALL_INT_SF_CTRL_ID0_INT = 23,                  /*!< sf_ctrl_id0_int */
    GLB_LP_ALL_INT_EMAC_INT = 24,                         /*!< emac_int */
    GLB_LP_ALL_INT_GPADC_DMA_INT = 25,                    /*!< gpadc_dma_int */
    GLB_LP_ALL_INT_EFUSE_INT = 26,                        /*!< efuse_int */
    GLB_LP_ALL_INT_SPI_0_INT = 27,                        /*!< spi_0_int */
    GLB_LP_ALL_INT_UART_IRQ = 28,                         /*!< uart_irq */
    GLB_LP_ALL_INT_UART1_IRQ = 29,                        /*!< uart1_irq */
    GLB_LP_ALL_INT_UART2_IRQ = 30,                        /*!< uart2_irq */
    GLB_LP_ALL_INT_GPIO_DMA_INT = 31,                     /*!< gpio_dma_int */
    GLB_LP_ALL_INT_I2C_0_INT = 32,                        /*!< i2c_0_int */
    GLB_LP_ALL_INT_PWM_INT = 33,                          /*!< pwm_int */
    GLB_LP_ALL_INT_IPC1_NP2AP_IRQ = 34,                   /*!< ipc1_np2ap_irq */
    GLB_LP_ALL_INT_IPC1_AP2NP_IRQ = 35,                   /*!< ipc1_ap2np_irq */
    GLB_LP_ALL_INT_TIMER0_2_IRQ = 36,                     /*!< timer0_2_irq */
    GLB_LP_ALL_INT_TIMER0_3_IRQ = 37,                     /*!< timer0_3_irq */
    GLB_LP_ALL_INT_WDT0_IRQ = 38,                         /*!< wdt0_irq */
    GLB_LP_ALL_INT_I2C_1_INT = 39,                        /*!< i2c_1_int */
    GLB_LP_ALL_INT_I2S0_INT = 40,                         /*!< i2s0_int */
    GLB_LP_ALL_INT_RSV41 = 41,                            /*!< rsv41 */
    GLB_LP_ALL_INT_RSV42 = 42,                            /*!< rsv42 */
    GLB_LP_ALL_INT_ANA_OCP_OUT_TO_CPU_IRQ = 43,           /*!< ana_ocp_out_to_cpu_irq[2:0] */
    GLB_LP_ALL_INT_GPIO_IRQ = 44,                         /*!< gpio_irq */
    GLB_LP_ALL_INT_DM_IRQ = 45,                           /*!< dm_irq */
    GLB_LP_ALL_INT_BT_IRQ = 46,                           /*!< bt_irq */
    GLB_LP_ALL_INT_M154_REQ_ENH_ACK_INT = 47,             /*!< m154_req_enh_ack_int */
    GLB_LP_ALL_INT_M154_INT = 48,                         /*!< m154_int */
    GLB_LP_ALL_INT_M154_AES_INT = 49,                     /*!< m154_aes_int */
    GLB_LP_ALL_INT_PDS_INT = 50,                          /*!< pds_int */
    GLB_LP_ALL_INT_HBN_IRQ_OUT_0 = 51,                    /*!< hbn_irq_out[0] */
    GLB_LP_ALL_INT_HBN_IRQ_OUT_1 = 52,                    /*!< hbn_irq_out[1] */
    GLB_LP_ALL_INT_BOR_OUT = 53,                          /*!< bor_out */
    GLB_LP_ALL_INT_WIFI_TO_CPU_IRQ_N = 54,                /*!< wifi_to_cpu_irq_n */
    GLB_LP_ALL_INT_BZ_PHY_INT = 55,                       /*!< bz_phy_int */
    GLB_LP_ALL_INT_BLE_INT = 56,                          /*!< ble_int */
    GLB_LP_ALL_INT_MAC_INT_TX_RX_TIMER = 57,              /*!< mac_int_tx_rx_timer */
    GLB_LP_ALL_INT_MAC_INT_TX_RX_MISC = 58,               /*!< mac_int_tx_rx_misc */
    GLB_LP_ALL_INT_MAC_INT_RX_TRIGGER = 59,               /*!< mac_int_rx_trigger */
    GLB_LP_ALL_INT_MAC_INT_TX_TRIGGER = 60,               /*!< mac_int_tx_trigger */
    GLB_LP_ALL_INT_MAC_INT_GEN = 61,                      /*!< mac_int_gen */
    GLB_LP_ALL_INT_MAC_INT_PROT_TRIGGER = 62,             /*!< mac_int_prot_trigger */
    GLB_LP_ALL_INT_WIFI_IPC = 63,                         /*!< wifi_ipc */
} GLB_LP_ALL_INT_Type;

/**
 *  @brief GLB dsp muxpll 320M clock type definition
 */
typedef enum {
    GLB_DSP_MUXPLL_SEL_WIFIPLL_320M, /*!< dsp muxpll select wifipll 320M */
    GLB_DSP_MUXPLL_SEL_AUPLL_DIV1,   /*!< dsp muxpll select aupll div1 */
} GLB_DSP_MUXPLL_320M_CLK_SEL_Type;

/**
 *  @brief GLB dsp muxpll 240M clock type definition
 */
typedef enum {
    GLB_DSP_MUXPLL_SEL_WIFIPLL_240M, /*!< dsp muxpll select wifipll 240M */
    GLB_DSP_MUXPLL_SEL_AUPLL_DIV2,   /*!< dsp muxpll select aupll div2 */
} GLB_DSP_MUXPLL_240M_CLK_SEL_Type;

/**
 *  @brief GLB dsp muxpll 160M clock type definition
 */
typedef enum {
    GLB_DSP_MUXPLL_SEL_WIFIPLL_160M, /*!< dsp muxpll select wifipll 160M */
    GLB_DSP_MUXPLL_SEL_CPUPLL_160M,  /*!< dsp muxpll select cpupll 160M */
} GLB_DSP_MUXPLL_160M_CLK_SEL_Type;

/**
 *  @brief GLB mcu muxpll 160M clock type definition
 */
typedef enum {
    GLB_MCU_MUXPLL_SEL_WIFIPLL_160M,    /*!< mcu muxpll select wifipll 160M */
    GLB_MCU_MUXPLL_SEL_TOP_CPUPLL_160M, /*!< mcu muxpll select top cpupll 160M */
    GLB_MCU_MUXPLL_SEL_TOP_AUPLL_DIV2,  /*!< mcu muxpll select top aupll div2 */
    GLB_MCU_MUXPLL_SEL_AUPLL_DIV2P5,    /*!< mcu muxpll select aupll div2p5 */
} GLB_MCU_MUXPLL_160M_CLK_SEL_Type;

/**
 *  @brief GLB mcu muxpll 80M clock type definition
 */
typedef enum {
    GLB_MCU_MUXPLL_SEL_WIFIPLL_80M,    /*!< mcu muxpll select wifipll 80M */
    GLB_MCU_MUXPLL_SEL_TOP_CPUPLL_80M, /*!< mcu muxpll select top cpupll 80M */
    GLB_MCU_MUXPLL_SEL_AUPLL_DIV5,     /*!< mcu muxpll select aupll div5 */
    GLB_MCU_MUXPLL_SEL_AUPLL_DIV6,     /*!< mcu muxpll select aupll div6 */
} GLB_MCU_MUXPLL_80M_CLK_SEL_Type;

/**
 *  @brief GLB pll clock gate type definition
 */
typedef enum {
    GLB_PLL_CGEN_MM_WIFIPLL_160M,  /*!< pll cgen mm wifipll 160m */
    GLB_PLL_CGEN_MM_WIFIPLL_240M,  /*!< pll cgen mm wifipll 240m */
    GLB_PLL_CGEN_MM_WIFIPLL_320M,  /*!< pll cgen mm wifipll 320m */
    GLB_PLL_CGEN_MM_AUPLL_DIV1,    /*!< pll cgen mm aupll div1 */
    GLB_PLL_CGEN_MM_AUPLL_DIV2,    /*!< pll cgen mm aupll div2 */
    GLB_PLL_CGEN_EMI_CPUPLL_400M,  /*!< pll cgen emi cpupll 400m */
    GLB_PLL_CGEN_EMI_CPUPLL_200M,  /*!< pll cgen emi cpupll 200m */
    GLB_PLL_CGEN_EMI_WIFIPLL_320M, /*!< pll cgen emi wifipll 320m */
    GLB_PLL_CGEN_EMI_AUPLL_DIV1,   /*!< pll cgen emi aupll div1 */
    GLB_PLL_CGEN_TOP_CPUPLL_80M,   /*!< pll cgen top cpupll 80m */
    GLB_PLL_CGEN_TOP_CPUPLL_100M,  /*!< pll cgen top cpupll 100m */
    GLB_PLL_CGEN_TOP_CPUPLL_160M,  /*!< pll cgen top cpupll 160m */
    GLB_PLL_CGEN_TOP_CPUPLL_400M,  /*!< pll cgen top cpupll 400m */
    GLB_PLL_CGEN_TOP_WIFIPLL_240M, /*!< pll cgen top wifipll 240m */
    GLB_PLL_CGEN_TOP_WIFIPLL_320M, /*!< pll cgen top wifipll 320m */
    GLB_PLL_CGEN_TOP_AUPLL_DIV2,   /*!< pll cgen top aupll div2 */
    GLB_PLL_CGEN_TOP_AUPLL_DIV1,   /*!< pll cgen top aupll div1 */
} GLB_PLL_CGEN_Type;

/**
 *  @brief GLB mcu system clock type definition
 */
typedef enum {
    GLB_MCU_SYS_CLK_RC32M,        /*!< use RC32M as system clock frequency */
    GLB_MCU_SYS_CLK_XTAL,         /*!< use XTAL as system clock */
    GLB_MCU_SYS_CLK_CPUPLL_400M,  /*!< use CPUPLL output 400M as system clock */
    GLB_MCU_SYS_CLK_WIFIPLL_240M, /*!< use WIFIPLL output 240M as system clock */
    GLB_MCU_SYS_CLK_WIFIPLL_320M, /*!< use WIFIPLL output 320M as system clock */
} GLB_MCU_SYS_CLK_Type;

/**
 *  @brief GLB dsp system clock type definition
 */
typedef enum {
    GLB_DSP_SYS_CLK_RC32M,           /*!< use RC32M as system clock frequency */
    GLB_DSP_SYS_CLK_XTAL,            /*!< use XTAL as system clock */
    GLB_DSP_SYS_CLK_MM_WIFIPLL_240M, /*!< use WIFIPLL 240M as system clock */
    GLB_DSP_SYS_CLK_MM_WIFIPLL_320M, /*!< use WIFIPLL 320M as system clock */
    GLB_DSP_SYS_CLK_CPUPLL_400M,     /*!< use CPUPLL output 400M as system clock */
} GLB_DSP_SYS_CLK_Type;

/**
 *  @brief GLB dsp pbus clock type definition
 */
typedef enum {
    GLB_DSP_SYS_PBCLK_RC32M,           /*!< use rc32m as pbus clock */
    GLB_DSP_SYS_PBCLK_XTAL,            /*!< use xtal as pbus clock */
    GLB_DSP_SYS_PBCLK_MM_WIFIPLL_160M, /*!< use mm_wifipll_160m_clk as pbus clock */
    GLB_DSP_SYS_PBCLK_CPUPLL_160M,     /*!< use cpupll_160m_clk as pbus clock */
    GLB_DSP_SYS_PBCLK_MM_WIFIPLL_240M, /*!< use mm_wifipll_240m_clk as pbus clock */
} GLB_DSP_SYS_PBCLK_Type;

/**
 *  @brief GLB dsp system clock type definition
 */
typedef enum {
    GLB_PLL_REFCLK_XTAL = 0,  /*!< use XTAL as pll ref clock */
    GLB_PLL_REFCLK_RC32M = 3, /*!< use RC32M as pll ref clock */
} GLB_PLL_REF_CLK_Type;

