RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/bl808_glb.h
/**
 *  @brief GLB DSP peripheral type definition
 */
typedef enum {
    GLB_DSP_PERIPHERAL_MM_MISC = 0, /*!< mm_misc */
    GLB_DSP_PERIPHERAL_DMA = 1,     /*!< dma */
    GLB_DSP_PERIPHERAL_UART0 = 2,   /*!< uart0 */
    GLB_DSP_PERIPHERAL_I2C0 = 3,    /*!< i2c0 */
    GLB_DSP_PERIPHERAL_IPC = 5,     /*!< ipc */
    GLB_DSP_PERIPHERAL_SPI = 8,     /*!< spi */
    GLB_DSP_PERIPHERAL_TIMER = 9,   /*!< timer */
    GLB_DSP_PERIPHERAL_I2S0 = 10,   /*!< i2s0 */
} GLB_DSP_PERIPHERAL_Type;

/**
 *  @brief GLB DSP sub type definition
 */
typedef enum {
    GLB_DSP_SUB_MISC = 0,     /*!< sub_misc */
    GLB_DSP_SUB_DVP2BUSA = 1, /*!< dvp2busA */
    GLB_DSP_SUB_DVP2BUSB = 2, /*!< dvp2busB */
    GLB_DSP_SUB_DVP2BUSC = 3, /*!< dvp2busC */
    GLB_DSP_SUB_OSD_DRAW = 4, /*!< osd_draw */
    GLB_DSP_SUB_DP = 5,       /*!< display */
    GLB_DSP_SUB_IMG_PR = 16,  /*!< img_pr scaler/yuv2rgb */
    GLB_DSP_SUB_SCLRA = 17,   /*!< ScalerA */
    GLB_DSP_SUB_SCLRB = 18,   /*!< ScalerB */
} GLB_DSP_SUB_Type;

/**
 *  @brief GLB DSP codec sub type definition
 */
typedef enum {
    GLB_DSP_CODEC_SUB_MJPEG = 1, /*!< mjpeg */
    GLB_DSP_CODEC_SUB_CNN = 2,   /*!< BLAI */
    GLB_DSP_CODEC_SUB_VRAM = 16, /*!< vram control logic(SRAM content would not be reset) */
} GLB_DSP_CODEC_SUB_Type;

/**
 *  @brief GLB DSP image sensor type definition
 */
typedef enum {
    GLB_DSP_IMAGE_SENSOR_RG_IS = 1, /*!< Image sensor */
} GLB_DSP_IMAGE_SENSOR_Type;

/**
 *  @brief GLB LDO15CIS level type definition
 */
typedef enum {
    GLB_LDO15CIS_LEVEL_1P00V = 0,  /*!< GLB LDO15CIS voltage 1.00V */
    GLB_LDO15CIS_LEVEL_1P05V = 1,  /*!< GLB LDO15CIS voltage 1.05V */
    GLB_LDO15CIS_LEVEL_1P10V = 2,  /*!< GLB LDO15CIS voltage 1.10V */
    GLB_LDO15CIS_LEVEL_1P15V = 3,  /*!< GLB LDO15CIS voltage 1.15V */
    GLB_LDO15CIS_LEVEL_1P20V = 4,  /*!< GLB LDO15CIS voltage 1.20V */
    GLB_LDO15CIS_LEVEL_1P30V = 5,  /*!< GLB LDO15CIS voltage 1.30V */
    GLB_LDO15CIS_LEVEL_1P40V = 6,  /*!< GLB LDO15CIS voltage 1.40V */
    GLB_LDO15CIS_LEVEL_1P45V = 7,  /*!< GLB LDO15CIS voltage 1.45V */
    GLB_LDO15CIS_LEVEL_1P50V = 8,  /*!< GLB LDO15CIS voltage 1.50V */
    GLB_LDO15CIS_LEVEL_1P55V = 9,  /*!< GLB LDO15CIS voltage 1.55V */
    GLB_LDO15CIS_LEVEL_1P60V = 10, /*!< GLB LDO15CIS voltage 1.60V */
    GLB_LDO15CIS_LEVEL_1P65V = 11, /*!< GLB LDO15CIS voltage 1.65V */
    GLB_LDO15CIS_LEVEL_1P70V = 12, /*!< GLB LDO15CIS voltage 1.70V */
    GLB_LDO15CIS_LEVEL_1P75V = 13, /*!< GLB LDO15CIS voltage 1.75V */
    GLB_LDO15CIS_LEVEL_1P80V = 14, /*!< GLB LDO15CIS voltage 1.80V */
    GLB_LDO15CIS_LEVEL_1P85V = 15, /*!< GLB LDO15CIS voltage 1.85V */
} GLB_LDO15CIS_LEVEL_Type;

/*@} end of group GLB_Public_Types */

/** @defgroup  GLB_Public_Constants
 *  @{
 */

/** @defgroup  GLB_CORE_ID_TYPE
 *  @{
 */
#define IS_GLB_CORE_ID_TYPE(type) (((type) == GLB_CORE_ID_M0) ||  \
                                   ((type) == GLB_CORE_ID_D0) ||  \
                                   ((type) == GLB_CORE_ID_LP) ||  \
                                   ((type) == GLB_CORE_ID_MAX) || \
                                   ((type) == GLB_CORE_ID_INVALID))

/** @defgroup  CCI_ID_TYPE
 *  @{
 */
#define IS_CCI_ID_TYPE(type) (((type) == CCI0_ID) || \
                              ((type) == CCI_ID_MAX))

/** @defgroup  GLB_DSP_ALL_INT_TYPE
 *  @{
 */
#define IS_GLB_DSP_ALL_INT_TYPE(type) (((type) == GLB_DSP_ALL_INT_BUS_DEC_ERR_INT) ||     \
                                       ((type) == GLB_DSP_ALL_INT_RSV1_INT) ||        \
                                       ((type) == GLB_DSP_ALL_INT_IPC2_NP2AP_IRQ) ||      \
                                       ((type) == GLB_DSP_ALL_INT_RSV3) ||                \
                                       ((type) == GLB_DSP_ALL_INT_UART0_INT) ||           \
                                       ((type) == GLB_DSP_ALL_INT_I2C0_INT) ||            \
                                       ((type) == GLB_DSP_ALL_INT_I2C1_INT) ||            \
                                       ((type) == GLB_DSP_ALL_INT_SPI_INT) ||             \
                                       ((type) == GLB_DSP_ALL_INT_RSV4_INT) ||          \
                                       ((type) == GLB_DSP_ALL_INT_RSV5_INT) ||         \
                                       ((type) == GLB_DSP_ALL_INT_SEOF1_INT) ||           \
                                       ((type) == GLB_DSP_ALL_INT_SEOF2_INT) ||           \
                                       ((type) == GLB_DSP_ALL_INT_SEOF3_INT) ||           \
                                       ((type) == GLB_DSP_ALL_INT_DVP2BUS_INT_0) ||       \
                                       ((type) == GLB_DSP_ALL_INT_DVP2BUS_INT_1) ||       \
                                       ((type) == GLB_DSP_ALL_INT_DVP2BUS_INT_2) ||       \
                                       ((type) == GLB_DSP_ALL_INT_DVP2BUS_INT_3) ||       \
                                       ((type) == GLB_DSP_ALL_INT_H264_BS_IRQ) ||         \
                                       ((type) == GLB_DSP_ALL_INT_H264_FRAME_IRQ) ||      \
                                       ((type) == GLB_DSP_ALL_INT_H264_SEQ_DONE_INT) ||   \
                                       ((type) == GLB_DSP_ALL_INT_MJPEG_INT) ||           \
                                       ((type) == GLB_DSP_ALL_INT_H264_S_BS_IRQ) ||       \
                                       ((type) == GLB_DSP_ALL_INT_H264_S_FRAME_IRQ) ||    \
                                       ((type) == GLB_DSP_ALL_INT_H264_S_SEQ_DONE_INT) || \
                                       ((type) == GLB_DSP_ALL_INT_DMA_INTR_0) ||          \
                                       ((type) == GLB_DSP_ALL_INT_DMA_INTR_1) ||          \
                                       ((type) == GLB_DSP_ALL_INT_DMA_INTR_2) ||          \
                                       ((type) == GLB_DSP_ALL_INT_DMA_INTR_3) ||          \
                                       ((type) == GLB_DSP_ALL_INT_DMA_INTR_4) ||          \
                                       ((type) == GLB_DSP_ALL_INT_DMA_INTR_5) ||          \
                                       ((type) == GLB_DSP_ALL_INT_DMA_INTR_6) ||          \
                                       ((type) == GLB_DSP_ALL_INT_DMA_INTR_7) ||          \
                                       ((type) == GLB_DSP_ALL_INT_RSV32) ||               \
                                       ((type) == GLB_DSP_ALL_INT_RSV33) ||               \
                                       ((type) == GLB_DSP_ALL_INT_RSV34) ||               \
                                       ((type) == GLB_DSP_ALL_INT_RSV35) ||               \
                                       ((type) == GLB_DSP_ALL_INT_RSV36) ||               \
                                       ((type) == GLB_DSP_ALL_INT_MIPI_CSI_INT) ||        \
                                       ((type) == GLB_DSP_ALL_INT_IPC2_AP2NP_IRQ) ||      \
                                       ((type) == GLB_DSP_ALL_INT_RSV39) ||               \
                                       ((type) == GLB_DSP_ALL_INT_MJDEC_INT) ||           \
                                       ((type) == GLB_DSP_ALL_INT_DVP2BUS_IN_4) ||        \
                                       ((type) == GLB_DSP_ALL_INT_DVP2BUS_IN_5) ||        \
                                       ((type) == GLB_DSP_ALL_INT_DVP2BUS_IN_6) ||        \
                                       ((type) == GLB_DSP_ALL_INT_DVP2BUS_IN_7) ||        \
                                       ((type) == GLB_DSP_ALL_INT_DMA2D_INT_0) ||         \
                                       ((type) == GLB_DSP_ALL_INT_DMA2D_INT_1) ||         \
                                       ((type) == GLB_DSP_ALL_INT_DP_SOEF0_INT) ||        \
                                       ((type) == GLB_DSP_ALL_INT_RSV48) ||               \
                                       ((type) == GLB_DSP_ALL_INT_RSV49) ||               \
                                       ((type) == GLB_DSP_ALL_INT_RSV50) ||               \
                                       ((type) == GLB_DSP_ALL_INT_RSV51) ||               \
                                       ((type) == GLB_DSP_ALL_INT_OSDDP_INT) ||           \
                                       ((type) == GLB_DSP_ALL_INT_DBI_INT) ||             \
                                       ((type) == GLB_DSP_ALL_INT_RSV6_INT) ||         \
                                       ((type) == GLB_DSP_ALL_INT_OSDA_INT) ||            \
                                       ((type) == GLB_DSP_ALL_INT_OSDB_INT) ||            \
                                       ((type) == GLB_DSP_ALL_INT_OSD_PB_INT) ||          \
                                       ((type) == GLB_DSP_ALL_INT_RSV7_INT) ||        \
                                       ((type) == GLB_DSP_ALL_INT_MIPI_DSI_INT) ||        \
                                       ((type) == GLB_DSP_ALL_INT_RSV8_INT) ||     \
                                       ((type) == GLB_DSP_ALL_INT_MM_TIMER_IRQ2) ||       \
                                       ((type) == GLB_DSP_ALL_INT_MM_TIMER_IRQ3) ||       \
                                       ((type) == GLB_DSP_ALL_INT_MM_WDT_IRQ))

/** @defgroup  GLB_MCU_ALL_INT_TYPE
 *  @{
 */
#define IS_GLB_MCU_ALL_INT_TYPE(type) (((type) == GLB_MCU_ALL_INT_BMX_ERR_INT) ||                      \
                                       ((type) == GLB_MCU_ALL_INT_BMX_TIMEOUT_INT_MCU_TIMEOUT_INT) ||  \
                                       ((type) == GLB_MCU_ALL_INT_IPC0_NP2AP_IRQ) ||                   \
                                       ((type) == GLB_MCU_ALL_INT_IPC0_AP2NP_IRQ) ||                   \
                                       ((type) == GLB_MCU_ALL_INT_AUDIO_INT) ||                        \
                                       ((type) == GLB_MCU_ALL_INT_RF_TOP_INT_0) ||                     \
                                       ((type) == GLB_MCU_ALL_INT_RF_TOP_INT_1) ||                     \
                                       ((type) == GLB_MCU_ALL_INT_LZ4_INT) ||                          \
                                       ((type) == GLB_MCU_ALL_INT_RSV8) ||                             \
                                       ((type) == GLB_MCU_ALL_INT_SEC_ENG_ID0_GMAC_INT) ||             \
                                       ((type) == GLB_MCU_ALL_INT_SEC_ENG_ID0_CDET_INT) ||             \
                                       ((type) == GLB_MCU_ALL_INT_SEC_ENG_ID0_PKA_INT) ||              \
                                       ((type) == GLB_MCU_ALL_INT_SEC_ENG_ID0_TRNG_INT) ||             \
                                       ((type) == GLB_MCU_ALL_INT_SEC_ENG_ID0_AES_INT) ||              \
                                       ((type) == GLB_MCU_ALL_INT_SEC_ENG_ID0_SHA_INT) ||              \
                                       ((type) == GLB_MCU_ALL_INT_DMA_INTR_ALL) ||                     \
                                       ((type) == GLB_MCU_ALL_INT_DMA2_INTR_ALL) ||                    \
                                       ((type) == GLB_MCU_ALL_INT_SDH_MMC1_INT_SDH2PMU_WAKEUP_INT1) || \
                                       ((type) == GLB_MCU_ALL_INT_MM_IRQ_ALL) ||                       \
                                       ((type) == GLB_MCU_ALL_INT_IRTX_INT) ||                         \
                                       ((type) == GLB_MCU_ALL_INT_IRRX_INT) ||                         \
                                       ((type) == GLB_MCU_ALL_INT_USB_INT) ||                          \
                                       ((type) == GLB_MCU_ALL_INT_AUPDM_INT) ||                        \
                                       ((type) == GLB_MCU_ALL_INT_SF_CTRL_ID0_INT) ||                  \
                                       ((type) == GLB_MCU_ALL_INT_EMAC_INT) ||                         \
                                       ((type) == GLB_MCU_ALL_INT_GPADC_DMA_INT) ||                    \
                                       ((type) == GLB_MCU_ALL_INT_EFUSE_INT) ||                        \
                                       ((type) == GLB_MCU_ALL_INT_SPI_0_INT) ||                        \
                                       ((type) == GLB_MCU_ALL_INT_UART_IRQ) ||                         \
                                       ((type) == GLB_MCU_ALL_INT_UART1_IRQ) ||                        \
                                       ((type) == GLB_MCU_ALL_INT_UART2_IRQ) ||                        \
                                       ((type) == GLB_MCU_ALL_INT_GPIO_DMA_INT) ||                     \
                                       ((type) == GLB_MCU_ALL_INT_I2C_0_INT) ||                        \
                                       ((type) == GLB_MCU_ALL_INT_PWM_INT) ||                          \
                                       ((type) == GLB_MCU_ALL_INT_IPC1_NP2AP_IRQ) ||                   \
                                       ((type) == GLB_MCU_ALL_INT_IPC1_AP2NP_IRQ) ||                   \
                                       ((type) == GLB_MCU_ALL_INT_TIMER0_2_IRQ) ||                     \
                                       ((type) == GLB_MCU_ALL_INT_TIMER0_3_IRQ) ||                     \
                                       ((type) == GLB_MCU_ALL_INT_WDT0_IRQ) ||                         \
                                       ((type) == GLB_MCU_ALL_INT_I2C_1_INT) ||                        \
                                       ((type) == GLB_MCU_ALL_INT_I2S0_INT) ||                         \
                                       ((type) == GLB_MCU_ALL_INT_RSV41) ||                            \
                                       ((type) == GLB_MCU_ALL_INT_RSV42) ||                            \
                                       ((type) == GLB_MCU_ALL_INT_ANA_OCP_OUT_TO_CPU_IRQ) ||           \
                                       ((type) == GLB_MCU_ALL_INT_GPIO_IRQ) ||                         \
                                       ((type) == GLB_MCU_ALL_INT_DM_IRQ) ||                           \
                                       ((type) == GLB_MCU_ALL_INT_BT_IRQ) ||                           \
                                       ((type) == GLB_MCU_ALL_INT_M154_REQ_ENH_ACK_INT) ||             \
                                       ((type) == GLB_MCU_ALL_INT_M154_INT) ||                         \
                                       ((type) == GLB_MCU_ALL_INT_M154_AES_INT) ||                     \
                                       ((type) == GLB_MCU_ALL_INT_PDS_INT) ||                          \
                                       ((type) == GLB_MCU_ALL_INT_HBN_IRQ_OUT_0) ||                    \
                                       ((type) == GLB_MCU_ALL_INT_HBN_IRQ_OUT_1) ||                    \
                                       ((type) == GLB_MCU_ALL_INT_BOR_OUT) ||                          \
                                       ((type) == GLB_MCU_ALL_INT_WIFI_TO_CPU_IRQ_N) ||                \
                                       ((type) == GLB_MCU_ALL_INT_BZ_PHY_INT) ||                       \
                                       ((type) == GLB_MCU_ALL_INT_BLE_INT) ||                          \
                                       ((type) == GLB_MCU_ALL_INT_MAC_INT_TX_RX_TIMER) ||              \
                                       ((type) == GLB_MCU_ALL_INT_MAC_INT_TX_RX_MISC) ||               \
                                       ((type) == GLB_MCU_ALL_INT_MAC_INT_RX_TRIGGER) ||               \
                                       ((type) == GLB_MCU_ALL_INT_MAC_INT_TX_TRIGGER) ||               \
                                       ((type) == GLB_MCU_ALL_INT_MAC_INT_GEN) ||                      \
                                       ((type) == GLB_MCU_ALL_INT_MAC_INT_PROT_TRIGGER) ||             \
                                       ((type) == GLB_MCU_ALL_INT_WIFI_IPC))

/** @defgroup  GLB_LP_ALL_INT_TYPE
 *  @{
 */
#define IS_GLB_LP_ALL_INT_TYPE(type) (((type) == GLB_LP_ALL_INT_BMX_ERR_INT) ||                      \
                                      ((type) == GLB_LP_ALL_INT_BMX_TIMEOUT_INT_MCU_TIMEOUT_INT) ||  \
                                      ((type) == GLB_LP_ALL_INT_IPC0_NP2AP_IRQ) ||                   \
                                      ((type) == GLB_LP_ALL_INT_IPC0_AP2NP_IRQ) ||                   \
                                      ((type) == GLB_LP_ALL_INT_AUDIO_INT) ||                        \
                                      ((type) == GLB_LP_ALL_INT_RF_TOP_INT_0) ||                     \
                                      ((type) == GLB_LP_ALL_INT_RF_TOP_INT_1) ||                     \
                                      ((type) == GLB_LP_ALL_INT_LZ4_INT) ||                          \
                                      ((type) == GLB_LP_ALL_INT_RSV8) ||                             \
                                      ((type) == GLB_LP_ALL_INT_SEC_ENG_ID0_GMAC_INT) ||             \
                                      ((type) == GLB_LP_ALL_INT_SEC_ENG_ID0_CDET_INT) ||             \
                                      ((type) == GLB_LP_ALL_INT_SEC_ENG_ID0_PKA_INT) ||              \
                                      ((type) == GLB_LP_ALL_INT_SEC_ENG_ID0_TRNG_INT) ||             \
                                      ((type) == GLB_LP_ALL_INT_SEC_ENG_ID0_AES_INT) ||              \
                                      ((type) == GLB_LP_ALL_INT_SEC_ENG_ID0_SHA_INT) ||              \
                                      ((type) == GLB_LP_ALL_INT_DMA_INTR_ALL) ||                     \
                                      ((type) == GLB_LP_ALL_INT_DMA2_INTR_ALL) ||                    \
                                      ((type) == GLB_LP_ALL_INT_SDH_MMC1_INT_SDH2PMU_WAKEUP_INT1) || \
                                      ((type) == GLB_LP_ALL_INT_MM_IRQ_ALL) ||                       \
                                      ((type) == GLB_LP_ALL_INT_IRTX_INT) ||                         \
                                      ((type) == GLB_LP_ALL_INT_IRRX_INT) ||                         \
                                      ((type) == GLB_LP_ALL_INT_USB_INT) ||                          \
                                      ((type) == GLB_LP_ALL_INT_AUPDM_INT) ||                        \
                                      ((type) == GLB_LP_ALL_INT_SF_CTRL_ID0_INT) ||                  \
                                      ((type) == GLB_LP_ALL_INT_EMAC_INT) ||                         \
                                      ((type) == GLB_LP_ALL_INT_GPADC_DMA_INT) ||                    \
                                      ((type) == GLB_LP_ALL_INT_EFUSE_INT) ||                        \
                                      ((type) == GLB_LP_ALL_INT_SPI_0_INT) ||                        \
                                      ((type) == GLB_LP_ALL_INT_UART_IRQ) ||                         \
                                      ((type) == GLB_LP_ALL_INT_UART1_IRQ) ||                        \
                                      ((type) == GLB_LP_ALL_INT_UART2_IRQ) ||                        \
                                      ((type) == GLB_LP_ALL_INT_GPIO_DMA_INT) ||                     \
                                      ((type) == GLB_LP_ALL_INT_I2C_0_INT) ||                        \
                                      ((type) == GLB_LP_ALL_INT_PWM_INT) ||                          \
                                      ((type) == GLB_LP_ALL_INT_IPC1_NP2AP_IRQ) ||                   \
                                      ((type) == GLB_LP_ALL_INT_IPC1_AP2NP_IRQ) ||                   \
                                      ((type) == GLB_LP_ALL_INT_TIMER0_2_IRQ) ||                     \
                                      ((type) == GLB_LP_ALL_INT_TIMER0_3_IRQ) ||                     \
                                      ((type) == GLB_LP_ALL_INT_WDT0_IRQ) ||                         \
                                      ((type) == GLB_LP_ALL_INT_I2C_1_INT) ||                        \
                                      ((type) == GLB_LP_ALL_INT_I2S0_INT) ||                         \
                                      ((type) == GLB_LP_ALL_INT_RSV41) ||                            \
                                      ((type) == GLB_LP_ALL_INT_RSV42) ||                            \
                                      ((type) == GLB_LP_ALL_INT_ANA_OCP_OUT_TO_CPU_IRQ) ||           \
                                      ((type) == GLB_LP_ALL_INT_GPIO_IRQ) ||                         \
                                      ((type) == GLB_LP_ALL_INT_DM_IRQ) ||                           \
                                      ((type) == GLB_LP_ALL_INT_BT_IRQ) ||                           \
                                      ((type) == GLB_LP_ALL_INT_M154_REQ_ENH_ACK_INT) ||             \
                                      ((type) == GLB_LP_ALL_INT_M154_INT) ||                         \
                                      ((type) == GLB_LP_ALL_INT_M154_AES_INT) ||                     \
                                      ((type) == GLB_LP_ALL_INT_PDS_INT) ||                          \
                                      ((type) == GLB_LP_ALL_INT_HBN_IRQ_OUT_0) ||                    \
                                      ((type) == GLB_LP_ALL_INT_HBN_IRQ_OUT_1) ||                    \
                                      ((type) == GLB_LP_ALL_INT_BOR_OUT) ||                          \
                                      ((type) == GLB_LP_ALL_INT_WIFI_TO_CPU_IRQ_N) ||                \
                                      ((type) == GLB_LP_ALL_INT_BZ_PHY_INT) ||                       \
                                      ((type) == GLB_LP_ALL_INT_BLE_INT) ||                          \
                                      ((type) == GLB_LP_ALL_INT_MAC_INT_TX_RX_TIMER) ||              \
                                      ((type) == GLB_LP_ALL_INT_MAC_INT_TX_RX_MISC) ||               \
                                      ((type) == GLB_LP_ALL_INT_MAC_INT_RX_TRIGGER) ||               \
                                      ((type) == GLB_LP_ALL_INT_MAC_INT_TX_TRIGGER) ||               \
                                      ((type) == GLB_LP_ALL_INT_MAC_INT_GEN) ||                      \
                                      ((type) == GLB_LP_ALL_INT_MAC_INT_PROT_TRIGGER) ||             \
                                      ((type) == GLB_LP_ALL_INT_WIFI_IPC))

/** @defgroup  GLB_DSP_MUXPLL_320M_CLK_SEL_TYPE
 *  @{
 */
#define IS_GLB_DSP_MUXPLL_320M_CLK_SEL_TYPE(type) (((type) == GLB_DSP_MUXPLL_SEL_WIFIPLL_320M) || \
                                                   ((type) == GLB_DSP_MUXPLL_SEL_AUPLL_DIV1))

/** @defgroup  GLB_DSP_MUXPLL_240M_CLK_SEL_TYPE
 *  @{
 */
#define IS_GLB_DSP_MUXPLL_240M_CLK_SEL_TYPE(type) (((type) == GLB_DSP_MUXPLL_SEL_WIFIPLL_240M) || \
                                                   ((type) == GLB_DSP_MUXPLL_SEL_AUPLL_DIV2))

/** @defgroup  GLB_DSP_MUXPLL_160M_CLK_SEL_TYPE
 *  @{
 */
#define IS_GLB_DSP_MUXPLL_160M_CLK_SEL_TYPE(type) (((type) == GLB_DSP_MUXPLL_SEL_WIFIPLL_160M) || \
                                                   ((type) == GLB_DSP_MUXPLL_SEL_CPUPLL_160M))

