RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/bl808_glb.h
/** @defgroup  GLB_MCU_MUXPLL_160M_CLK_SEL_TYPE
 *  @{
 */
#define IS_GLB_MCU_MUXPLL_160M_CLK_SEL_TYPE(type) (((type) == GLB_MCU_MUXPLL_SEL_WIFIPLL_160M) ||    \
                                                   ((type) == GLB_MCU_MUXPLL_SEL_TOP_CPUPLL_160M) || \
                                                   ((type) == GLB_MCU_MUXPLL_SEL_TOP_AUPLL_DIV2) ||  \
                                                   ((type) == GLB_MCU_MUXPLL_SEL_AUPLL_DIV2P5))

/** @defgroup  GLB_MCU_MUXPLL_80M_CLK_SEL_TYPE
 *  @{
 */
#define IS_GLB_MCU_MUXPLL_80M_CLK_SEL_TYPE(type) (((type) == GLB_MCU_MUXPLL_SEL_WIFIPLL_80M) ||    \
                                                  ((type) == GLB_MCU_MUXPLL_SEL_TOP_CPUPLL_80M) || \
                                                  ((type) == GLB_MCU_MUXPLL_SEL_AUPLL_DIV5) ||     \
                                                  ((type) == GLB_MCU_MUXPLL_SEL_AUPLL_DIV6))

/** @defgroup  GLB_PLL_CGEN_TYPE
 *  @{
 */
#define IS_GLB_PLL_CGEN_TYPE(type) (((type) == GLB_PLL_CGEN_MM_WIFIPLL_160M) ||  \
                                    ((type) == GLB_PLL_CGEN_MM_WIFIPLL_240M) ||  \
                                    ((type) == GLB_PLL_CGEN_MM_WIFIPLL_320M) ||  \
                                    ((type) == GLB_PLL_CGEN_MM_AUPLL_DIV1) ||    \
                                    ((type) == GLB_PLL_CGEN_MM_AUPLL_DIV2) ||    \
                                    ((type) == GLB_PLL_CGEN_EMI_CPUPLL_400M) ||  \
                                    ((type) == GLB_PLL_CGEN_EMI_CPUPLL_200M) ||  \
                                    ((type) == GLB_PLL_CGEN_EMI_WIFIPLL_320M) || \
                                    ((type) == GLB_PLL_CGEN_EMI_AUPLL_DIV1) ||   \
                                    ((type) == GLB_PLL_CGEN_TOP_CPUPLL_80M) ||   \
                                    ((type) == GLB_PLL_CGEN_TOP_CPUPLL_100M) ||  \
                                    ((type) == GLB_PLL_CGEN_TOP_CPUPLL_160M) ||  \
                                    ((type) == GLB_PLL_CGEN_TOP_CPUPLL_400M) ||  \
                                    ((type) == GLB_PLL_CGEN_TOP_WIFIPLL_240M) || \
                                    ((type) == GLB_PLL_CGEN_TOP_WIFIPLL_320M) || \
                                    ((type) == GLB_PLL_CGEN_TOP_AUPLL_DIV2) ||   \
                                    ((type) == GLB_PLL_CGEN_TOP_AUPLL_DIV1))

/** @defgroup  GLB_MCU_SYS_CLK_TYPE
 *  @{
 */
#define IS_GLB_MCU_SYS_CLK_TYPE(type) (((type) == GLB_MCU_SYS_CLK_RC32M) ||        \
                                       ((type) == GLB_MCU_SYS_CLK_XTAL) ||         \
                                       ((type) == GLB_MCU_SYS_CLK_CPUPLL_400M) ||  \
                                       ((type) == GLB_MCU_SYS_CLK_WIFIPLL_240M) || \
                                       ((type) == GLB_MCU_SYS_CLK_WIFIPLL_320M))

/** @defgroup  GLB_DSP_SYS_CLK_TYPE
 *  @{
 */
#define IS_GLB_DSP_SYS_CLK_TYPE(type) (((type) == GLB_DSP_SYS_CLK_RC32M) ||           \
                                       ((type) == GLB_DSP_SYS_CLK_XTAL) ||            \
                                       ((type) == GLB_DSP_SYS_CLK_MM_WIFIPLL_240M) || \
                                       ((type) == GLB_DSP_SYS_CLK_MM_WIFIPLL_320M) || \
                                       ((type) == GLB_DSP_SYS_CLK_CPUPLL_400M))

/** @defgroup  GLB_DSP_SYS_PBCLK_TYPE
 *  @{
 */
#define IS_GLB_DSP_SYS_PBCLK_TYPE(type) (((type) == GLB_DSP_SYS_PBCLK_RC32M) ||           \
                                         ((type) == GLB_DSP_SYS_PBCLK_XTAL) ||            \
                                         ((type) == GLB_DSP_SYS_PBCLK_MM_WIFIPLL_160M) || \
                                         ((type) == GLB_DSP_SYS_PBCLK_CPUPLL_160M) ||     \
                                         ((type) == GLB_DSP_SYS_PBCLK_MM_WIFIPLL_240M))

/** @defgroup  GLB_PLL_REF_CLK_TYPE
 *  @{
 */
#define IS_GLB_PLL_REF_CLK_TYPE(type) (((type) == GLB_PLL_REFCLK_XTAL) || \
                                       ((type) == GLB_PLL_REFCLK_RC32M))

/** @defgroup  GLB_WIFIPLL_REF_CLK_Type
 *  @{
 */
#define IS_GLB_WIFIPLL_REF_CLK_TYPE(type) (((type) == GLB_WIFIPLL_REF_XTAL_SOC_CLK) || \
                                           ((type) == GLB_WIFIPLL_REF_XTAL_CLK) ||     \
                                           ((type) == GLB_WIFIPLL_REF_XTAL_LO_CLK) ||  \
                                           ((type) == GLB_WIFIPLL_REF_RC32M_CLK))

/** @defgroup  GLB_AUPLL_REF_CLK_Type
 *  @{
 */
#define IS_GLB_AUPLL_REF_CLK_TYPE(type) (((type) == GLB_AUPLL_REF_XTAL_SOC_CLK) || \
                                         ((type) == GLB_AUPLL_REF_RC32M_CLK))

/** @defgroup  GLB_CPUPLL_REF_CLK_Type
 *  @{
 */
#define IS_GLB_CPUPLL_REF_CLK_TYPE(type) (((type) == GLB_CPUPLL_REF_XTAL_SOC_CLK) || \
                                          ((type) == GLB_CPUPLL_REF_RC32M_CLK))

/** @defgroup  GLB_MIPIPLL_REF_CLK_Type
 *  @{
 */
#define IS_GLB_MIPIPLL_REF_CLK_TYPE(type) (((type) == GLB_MIPIPLL_REF_XTAL_SOC_CLK) || \
                                           ((type) == GLB_MIPIPLL_REF_RC32M_CLK))

/** @defgroup  GLB_UHSPLL_REF_CLK_Type
 *  @{
 */
#define IS_GLB_UHSPLL_REF_CLK_TYPE(type) (((type) == GLB_UHSPLL_REF_XTAL_SOC_CLK) || \
                                          ((type) == GLB_UHSPLL_REF_RC32M_CLK))

/** @defgroup  GLB_CAM_CLK_TYPE
 *  @{
 */
#define IS_GLB_CAM_CLK_TYPE(type) (((type) == GLB_CAM_CLK_XCLK) ||        \
                                   ((type) == GLB_CAM_CLK_WIFIPLL_96M) || \
                                   ((type) == GLB_CAM_CLK_CPUPLL_100M))

/** @defgroup  GLB_SDH_CLK_TYPE
 *  @{
 */
#define IS_GLB_SDH_CLK_TYPE(type) (((type) == GLB_SDH_CLK_WIFIPLL_96M) || \
                                   ((type) == GLB_SDH_CLK_CPUPLL_100M))

/** @defgroup  GLB_GLB_UART_SIG_SWAP_SET_TYPE
 *  @{
 */
#define IS_GLB_UART_SIG_SWAP_GRP_TYPE(type) (((type) == GLB_UART_SIG_SWAP_GRP_GPIO0_GPIO11) ||  \
                                             ((type) == GLB_UART_SIG_SWAP_GRP_GPIO12_GPIO23) || \
                                             ((type) == GLB_UART_SIG_SWAP_GRP_GPIO24_GPIO35) || \
                                             ((type) == GLB_UART_SIG_SWAP_GRP_GPIO36_GPIO45))

/** @defgroup  GLB_I2S_OUT_REF_CLK_TYPE
 *  @{
 */
#define IS_GLB_I2S_OUT_REF_CLK_TYPE(type) (((type) == GLB_I2S_OUT_REF_CLK_NONE) || \
                                           ((type) == GLB_I2S_OUT_REF_CLK_SRC))

/** @defgroup  GLB_DMA_CLK_ID_TYPE
 *  @{
 */
#define IS_GLB_DMA_CLK_ID_TYPE(type) (((type) == GLB_DMA0_CLK_CH0) || \
                                      ((type) == GLB_DMA0_CLK_CH1) || \
                                      ((type) == GLB_DMA0_CLK_CH2) || \
                                      ((type) == GLB_DMA0_CLK_CH3) || \
                                      ((type) == GLB_DMA0_CLK_CH4) || \
                                      ((type) == GLB_DMA0_CLK_CH5) || \
                                      ((type) == GLB_DMA0_CLK_CH6) || \
                                      ((type) == GLB_DMA0_CLK_CH7) || \
                                      ((type) == GLB_DMA1_CLK_CH0) || \
                                      ((type) == GLB_DMA1_CLK_CH1) || \
                                      ((type) == GLB_DMA1_CLK_CH2) || \
                                      ((type) == GLB_DMA1_CLK_CH3))

/** @defgroup  GLB_PERI_DMA_TYPE
 *  @{
 */
#define IS_GLB_PERI_DMA_TYPE(type) (((type) == GLB_PERI_DMA_UART0_RX) || \
                                    ((type) == GLB_PERI_DMA_UART0_TX) || \
                                    ((type) == GLB_PERI_DMA_UART1_RX) || \
                                    ((type) == GLB_PERI_DMA_UART1_TX) || \
                                    ((type) == GLB_PERI_DMA_UART2_RX) || \
                                    ((type) == GLB_PERI_DMA_UART2_TX) || \
                                    ((type) == GLB_PERI_DMA_I2C_0_RX) || \
                                    ((type) == GLB_PERI_DMA_I2C_0_TX) || \
                                    ((type) == GLB_PERI_DMA_IRTX_TX) ||  \
                                    ((type) == GLB_PERI_DMA_GPIO_TX) ||  \
                                    ((type) == GLB_PERI_DMA_SPI_RX) ||   \
                                    ((type) == GLB_PERI_DMA_SPI_TX) ||   \
                                    ((type) == GLB_PERI_DMA_AUDIO_RX) || \
                                    ((type) == GLB_PERI_DMA_AUDIO_TX) || \
                                    ((type) == GLB_PERI_DMA_I2C_1_RX) || \
                                    ((type) == GLB_PERI_DMA_I2C_1_TX) || \
                                    ((type) == GLB_PERI_DMA_I2S_0_RX) || \
                                    ((type) == GLB_PERI_DMA_I2S_0_TX) || \
                                    ((type) == GLB_PERI_DMA_PDM_RX) ||   \
                                    ((type) == GLB_PERI_DMA_PADC) ||     \
                                    ((type) == GLB_PERI_DMA_GAUGE) ||    \
                                    ((type) == GLB_PERI_DMA_GPADC) ||    \
                                    ((type) == GLB_PERI_DMA_GPDAC_TX))

/** @defgroup  GLB_PERI_DMA_CN_SEL_TYPE
 *  @{
 */
#define IS_GLB_PERI_DMA_CN_SEL_TYPE(type) (((type) == GLB_PERI_DMA_CN_SEL_DMA0) || \
                                           ((type) == GLB_PERI_DMA_CN_SEL_DMA1))

/** @defgroup  GLB_IR_CLK_SRC_TYPE
 *  @{
 */
#define IS_GLB_IR_CLK_SRC_TYPE(type) (((type) == GLB_IR_CLK_SRC_XCLK))

/** @defgroup  GLB_SFLASH_CLK_TYPE
 *  @{
 */
#define IS_GLB_SFLASH_CLK_TYPE(type) (((type) == GLB_SFLASH_CLK_120M_WIFIPLL) || \
                                      ((type) == GLB_SFLASH_CLK_XTAL) ||         \
                                      ((type) == GLB_SFLASH_CLK_100M_CPUPLL) ||  \
                                      ((type) == GLB_SFLASH_CLK_80M_MUXPLL) ||   \
                                      ((type) == GLB_SFLASH_CLK_BCLK) ||         \
                                      ((type) == GLB_SFLASH_CLK_96M_WIFIPLL))

/** @defgroup  GLB_I2C_CLK_TYPE
 *  @{
 */
#define IS_GLB_I2C_CLK_TYPE(type) (((type) == GLB_I2C_CLK_BCLK) || \
                                   ((type) == GLB_I2C_CLK_XCLK))

/** @defgroup  GLB_SPI_CLK_TYPE
 *  @{
 */
#define IS_GLB_SPI_CLK_TYPE(type) (((type) == GLB_SPI_CLK_PLL160M) || \
                                   ((type) == GLB_SPI_CLK_XCLK))

