RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/bl808_glb.h
/** @defgroup  GLB_PWM1_IO_SEL_TYPE
 *  @{
 */
#define IS_GLB_PWM1_IO_SEL_TYPE(type) (((type) == GLB_PWM1_IO_SINGLE_END) || \
                                       ((type) == GLB_PWM1_IO_DIFF_END))

/** @defgroup  GLB_PWM2_IO_SEL_TYPE
 *  @{
 */
#define IS_GLB_PWM2_IO_SEL_TYPE(type) (((type) == GLB_PWM2_IO_SINGLE_END) || \
                                       ((type) == GLB_PWM2_IO_SINGLE_END_BLDC))

/** @defgroup  GLB_PDM_IO_SEL_TYPE
 *  @{
 */
#define IS_GLB_PDM_IO_SEL_TYPE(type) (((type) == GLB_PDM_IO_SEL_AUDIO_TOP) || \
                                      ((type) == GLB_PDM_IO_SEL_AUPDM_TOP))

/** @defgroup  GLB_SPI_PAD_ACT_AS_TYPE
 *  @{
 */
#define IS_GLB_SPI_PAD_ACT_AS_TYPE(type) (((type) == GLB_SPI_PAD_ACT_AS_SLAVE) || \
                                          ((type) == GLB_SPI_PAD_ACT_AS_MASTER))

/** @defgroup  GLB_AHB_SW_TYPE
 *  @{
 */
#define IS_GLB_AHB_MCU_SW_TYPE(type) (((type) == GLB_AHB_MCU_SW_RSV0) ||               \
                                      ((type) == GLB_AHB_MCU_SW_RSV1) ||               \
                                      ((type) == GLB_AHB_MCU_SW_WIFI) ||               \
                                      ((type) == GLB_AHB_MCU_SW_BTDM) ||               \
                                      ((type) == GLB_AHB_MCU_SW_ZIGBEE) ||             \
                                      ((type) == GLB_AHB_MCU_SW_BLE2) ||               \
                                      ((type) == GLB_AHB_MCU_SW_ZIGBEE2) ||            \
                                      ((type) == GLB_AHB_MCU_SW_EMI_MISC) ||           \
                                      ((type) == GLB_AHB_MCU_SW_PSRAM0_CTRL) ||        \
                                      ((type) == GLB_AHB_MCU_SW_PSRAM1_CTRL) ||        \
                                      ((type) == GLB_AHB_MCU_SW_USB) ||                \
                                      ((type) == GLB_AHB_MCU_SW_MIX2) ||               \
                                      ((type) == GLB_AHB_MCU_SW_AUDIO) ||              \
                                      ((type) == GLB_AHB_MCU_SW_SDH) ||                \
                                      ((type) == GLB_AHB_MCU_SW_EMAC) ||               \
                                      ((type) == GLB_AHB_MCU_SW_DMA2) ||               \
                                      ((type) == GLB_AHB_MCU_SW_GLB) ||                \
                                      ((type) == GLB_AHB_MCU_SW_MIX) ||                \
                                      ((type) == GLB_AHB_MCU_SW_GPIP) ||               \
                                      ((type) == GLB_AHB_MCU_SW_SEC_DBG) ||            \
                                      ((type) == GLB_AHB_MCU_SW_SEC_ENG) ||            \
                                      ((type) == GLB_AHB_MCU_SW_TZ1) ||                \
                                      ((type) == GLB_AHB_MCU_SW_TZ2) ||                \
                                      ((type) == GLB_AHB_MCU_SW_EFUSE) ||              \
                                      ((type) == GLB_AHB_MCU_SW_CCI) ||                \
                                      ((type) == GLB_AHB_MCU_SW_L1C) ||                \
                                      ((type) == GLB_AHB_MCU_SW_RSV42) ||              \
                                      ((type) == GLB_AHB_MCU_SW_SF) ||                 \
                                      ((type) == GLB_AHB_MCU_SW_DMA) ||                \
                                      ((type) == GLB_AHB_MCU_SW_SDU) ||                \
                                      ((type) == GLB_AHB_MCU_SW_PDS) ||                \
                                      ((type) == GLB_AHB_MCU_SW_RSV47) ||              \
                                      ((type) == GLB_AHB_MCU_SW_UART0) ||              \
                                      ((type) == GLB_AHB_MCU_SW_UART1) ||              \
                                      ((type) == GLB_AHB_MCU_SW_SPI) ||                \
                                      ((type) == GLB_AHB_MCU_SW_I2C) ||                \
                                      ((type) == GLB_AHB_MCU_SW_PWM) ||                \
                                      ((type) == GLB_AHB_MCU_SW_TIMER) ||              \
                                      ((type) == GLB_AHB_MCU_SW_IR_REMOTE) ||          \
                                      ((type) == GLB_AHB_MCU_SW_CHECKSUM) ||           \
                                      ((type) == GLB_AHB_MCU_SW_QDEC) ||               \
                                      ((type) == GLB_AHB_MCU_SW_KYS) ||                \
                                      ((type) == GLB_AHB_MCU_SW_UART2) ||              \
                                      ((type) == GLB_AHB_MCU_SW_RSV59) ||              \
                                      ((type) == GLB_AHB_MCU_SW_RSV60) ||              \
                                      ((type) == GLB_AHB_MCU_SW_RSV61) ||              \
                                      ((type) == GLB_AHB_MCU_SW_RSV62) ||              \
                                      ((type) == GLB_AHB_MCU_SW_RSV63) ||              \
                                      ((type) == GLB_AHB_MCU_SW_PWRON_RST) ||          \
                                      ((type) == GLB_AHB_MCU_SW_CPU_RESET) ||          \
                                      ((type) == GLB_AHB_MCU_SW_SYS_RESET) ||          \
                                      ((type) == GLB_AHB_MCU_SW_PICO_RESET) ||         \
                                      ((type) == GLB_AHB_MCU_SW_CPU2_RESET) ||         \
                                      ((type) == GLB_AHB_MCU_SW_CHIP_RESET) ||         \
                                      ((type) == GLB_AHB_MCU_SW_WL_WDT_RESET_MM_EN) || \
                                      ((type) == GLB_AHB_MCU_SW_MMWDT2WL_RST_MSK))

/** @defgroup  GLB_AHB_DSP_SW_TYPE
 *  @{
 */
#define IS_GLB_AHB_DSP_SW_TYPE(type) (((type) == GLB_AHB_DSP_SW_REG_CTRL_SYS_RESET) ||    \
                                      ((type) == GLB_AHB_DSP_SW_REG_CTRL_PWRON_RST) ||    \
                                      ((type) == GLB_AHB_DSP_SW_REG_CTRL_MMCPU0_RESET) || \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_MM_MISC) ||         \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_DMA) ||             \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_UART0) ||           \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_I2C0) ||            \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_I2C1) ||            \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_IPC) ||             \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_DMA2D) ||           \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_SPI) ||             \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_TIMER) ||           \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_I2S0) ||            \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_I2S1) ||            \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_PDM0) ||            \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_PDM1) ||            \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_PUHS) ||            \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_SUB_MISC) ||        \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_SUB_MAIN) ||        \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_SUB_TSRC) ||        \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_DP_TSRC) ||         \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_NR3D_CTRL) ||       \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_DVP2BUSA) ||        \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_DVP2BUSB) ||        \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_DVP2BUSC) ||        \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_DVP2BUSD) ||        \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_MIPI) ||            \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_SUB_REG) ||         \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_DVP2BUSE) ||        \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_DVP2BUSF) ||        \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_DVP2BUSG) ||        \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_DVP2BUSH) ||        \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_CODEC_MISC) ||      \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_MJPEG) ||           \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_H264) ||            \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_MJPEG_DEC) ||       \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_CNN) ||             \
                                      ((type) == GLB_AHB_DSP_SW_SWRST_VRAM) ||            \
                                      ((type) == GLB_AHB_DSP_SW_RG_IS_RST_N))

/** @defgroup  GLB DISRST_TYPE
 *  @{
 */
#define IS_GLB_DISRST_TYPE(type) (((type) == GLB_DISRST_GPIP) ||      \
                                  ((type) == GLB_DISRST_SEC_ENG) ||   \
                                  ((type) == GLB_DISRST_CCI) ||       \
                                  ((type) == GLB_DISRST_SF) ||        \
                                  ((type) == GLB_DISRST_UART0) ||     \
                                  ((type) == GLB_DISRST_UART1) ||     \
                                  ((type) == GLB_DISRST_SPI) ||       \
                                  ((type) == GLB_DISRST_I2C0) ||      \
                                  ((type) == GLB_DISRST_PWM) ||       \
                                  ((type) == GLB_DISRST_TIMER) ||     \
                                  ((type) == GLB_DISRST_IR_REMOTE) || \
                                  ((type) == GLB_DISRST_CHECKSUM) ||  \
                                  ((type) == GLB_DISRST_IPC) ||       \
                                  ((type) == GLB_DISRST_I2C1) ||      \
                                  ((type) == GLB_DISRST_UART2))

