RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/bl808_glb.h
/** @defgroup  GLB_PKA_CLK_TYPE
 *  @{
 */
#define IS_GLB_PKA_CLK_TYPE(type) (((type) == GLB_PKA_CLK_MCU_BCLK) || \
                                   ((type) == GLB_PKA_CLK_MCU_MUXPLL_160M))

/** @defgroup  GLB_MCU_SW_SYSTEM_TYPE
 *  @{
 */
#define IS_GLB_MCU_SW_SYSTEM_TYPE(type) (((type) == GLB_MCU_SW_SYSTEM_CTRL_MCU) || \
                                         ((type) == GLB_MCU_SW_SYSTEM_CTRL_LP))

/** @defgroup  BMX_ARB_TYPE
 *  @{
 */
#define IS_BMX_ARB_TYPE(type) (((type) == BMX_ARB_ROUND_ROBIN) || \
                               ((type) == BMX_ARB_FIX))

/** @defgroup  BMX_LATCH_TYPE
 *  @{
 */
#define IS_BMX_LATCH_TYPE(type) (((type) == BMX_LATCH_FIRST_ERROR) || \
                                 ((type) == BMX_LATCH_LAST_ERROR))

/** @defgroup  BMX_BUS_ERR_TYPE
 *  @{
 */
#define IS_BMX_BUS_ERR_TYPE(type) (((type) == BMX_BUS_ERR_TRUSTZONE_DECODE) || \
                                   ((type) == BMX_BUS_ERR_ADDR_DECODE))

/** @defgroup  BMX_ERR_INT_TYPE
 *  @{
 */
#define IS_BMX_ERR_INT_TYPE(type) (((type) == BMX_ERR_INT_ERR) || \
                                   ((type) == BMX_ERR_INT_ALL))

/** @defgroup  BMX_TO_INT_TYPE
 *  @{
 */
#define IS_BMX_TO_INT_TYPE(type) (((type) == BMX_TO_INT_TIMEOUT) || \
                                  ((type) == BMX_TO_INT_ALL))

/** @defgroup  GLB_ETH_REF_CLK_OUT_TYPE
 *  @{
 */
#define IS_GLB_ETH_REF_CLK_OUT_TYPE(type) (((type) == GLB_ETH_REF_CLK_OUT_OUTSIDE_50M) || \
                                           ((type) == GLB_ETH_REF_CLK_OUT_INSIDE_50M))

/** @defgroup  GLB_EM_TYPE
 *  @{
 */
#define IS_GLB_EM_TYPE(type) (((type) == GLB_WRAM160KB_EM0KB) ||  \
                              ((type) == GLB_WRAM144KB_EM16KB) || \
                              ((type) == GLB_WRAM128KB_EM32KB) || \
                              ((type) == GLB_WRAM112KB_EM48KB) || \
                              ((type) == GLB_WRAM96KB_EM64KB))

/** @defgroup  GLB_ADC_CLK_TYPE
 *  @{
 */
#define IS_GLB_ADC_CLK_TYPE(type) (((type) == GLB_ADC_CLK_AUPLL) || \
                                   ((type) == GLB_ADC_CLK_XCLK))

/** @defgroup  GLB_DAC_CLK_TYPE
 *  @{
 */
#define IS_GLB_DAC_CLK_TYPE(type) (((type) == GLB_DAC_CLK_32M) || \
                                   ((type) == GLB_DAC_CLK_XCLK))

/** @defgroup  GLB_CHIP_CLK_INOUT_TYPE
 *  @{
 */
#define IS_GLB_CHIP_CLK_INOUT_TYPE(type) (((type) == GLB_CHIP_CLK_INOUT_INPUT) || \
                                          ((type) == GLB_CHIP_CLK_INOUT_OUTPUT))

/** @defgroup  GLB_CHIP_CLK_OUT_0_TYPE
 *  @{
 */
#define IS_GLB_CHIP_CLK_OUT_0_TYPE(type) (((type) == GLB_CHIP_CLK_OUT_0_CAM_REF_CLK) ||   \
                                          ((type) == GLB_CHIP_CLK_OUT_0_I2S_REF_CLK) ||   \
                                          ((type) == GLB_CHIP_CLK_OUT_0_CLK_AUDIO_ADC) || \
                                          ((type) == GLB_CHIP_CLK_OUT_0_CLK_AUDIO_DAC))

/** @defgroup  GLB_CHIP_CLK_OUT_1_TYPE
 *  @{
 */
#define IS_GLB_CHIP_CLK_OUT_1_TYPE(type) (((type) == GLB_CHIP_CLK_OUT_1_CAM_REF_CLK) ||   \
                                          ((type) == GLB_CHIP_CLK_OUT_1_I2S_REF_CLK) ||   \
                                          ((type) == GLB_CHIP_CLK_OUT_1_CLK_AUDIO_ADC) || \
                                          ((type) == GLB_CHIP_CLK_OUT_1_CLK_AUDIO_DAC))

/** @defgroup  GLB_CHIP_CLK_OUT_2_TYPE
 *  @{
 */
#define IS_GLB_CHIP_CLK_OUT_2_TYPE(type) (((type) == GLB_CHIP_CLK_OUT_2_CAM_REF_CLK) ||  \
                                          ((type) == GLB_CHIP_CLK_OUT_2_I2S_REF_CLK) ||  \
                                          ((type) == GLB_CHIP_CLK_OUT_2_ANA_XTAL_CLK) || \
                                          ((type) == GLB_CHIP_CLK_OUT_2_PLL_32M_CLK))

/** @defgroup  GLB_CHIP_CLK_OUT_3_TYPE
 *  @{
 */
#define IS_GLB_CHIP_CLK_OUT_3_TYPE(type) (((type) == GLB_CHIP_CLK_OUT_3_CAM_REF_CLK) || \
                                          ((type) == GLB_CHIP_CLK_OUT_3_I2S_REF_CLK) || \
                                          ((type) == GLB_CHIP_CLK_OUT_3_NONE) ||        \
                                          ((type) == GLB_CHIP_CLK_OUT_3_PLL_48M_CLK))

/** @defgroup  GLB_CSI_DSI_CLK_SEL_TYPE
 *  @{
 */
#define IS_GLB_CSI_DSI_CLK_SEL_TYPE(type) (((type) == GLB_CSI_DSI_CLK_SEL_XTAL_CLK) || \
                                           ((type) == GLB_CSI_DSI_CLK_SEL_CPUPLL_DIV10))

/** @defgroup  GLB_DIG_CLK_TYPE
 *  @{
 */
#define IS_GLB_DIG_CLK_TYPE(type) (((type) == GLB_DIG_CLK_WIFIPLL_32M) || \
                                   ((type) == GLB_DIG_CLK_XCLK) ||        \
                                   ((type) == GLB_DIG_CLK_AUPLL))

/** @defgroup  GLB_512K_CLK_OUT_TYPE
 *  @{
 */
#define IS_GLB_512K_CLK_OUT_TYPE(type) (((type) == GLB_512K_CLK_OUT_512K) || \
                                        ((type) == GLB_512K_CLK_OUT_256K) || \
                                        ((type) == GLB_512K_CLK_OUT_128K))

/** @defgroup  GLB_BT_BANDWIDTH_TYPE
 *  @{
 */
#define IS_GLB_BT_BANDWIDTH_TYPE(type) (((type) == GLB_BT_BANDWIDTH_1M) || \
                                        ((type) == GLB_BT_BANDWIDTH_2M))

/** @defgroup  GLB_UART2_IO_SEL_TYPE
 *  @{
 */
#define IS_GLB_UART2_IO_SEL_TYPE(type) (((type) == GLB_UART2_IO_SEL_UART2))

/** @defgroup  GLB_UART_SIG_TYPE
 *  @{
 */
#define IS_GLB_UART_SIG_TYPE(type) (((type) == GLB_UART_SIG_0) ||  \
                                    ((type) == GLB_UART_SIG_1) ||  \
                                    ((type) == GLB_UART_SIG_2) ||  \
                                    ((type) == GLB_UART_SIG_3) ||  \
                                    ((type) == GLB_UART_SIG_4) ||  \
                                    ((type) == GLB_UART_SIG_5) ||  \
                                    ((type) == GLB_UART_SIG_6) ||  \
                                    ((type) == GLB_UART_SIG_7) ||  \
                                    ((type) == GLB_UART_SIG_8) ||  \
                                    ((type) == GLB_UART_SIG_9) ||  \
                                    ((type) == GLB_UART_SIG_10) || \
                                    ((type) == GLB_UART_SIG_11))

/** @defgroup  GLB_UART_SIG_FUN_TYPE
 *  @{
 */
#define IS_GLB_UART_SIG_FUN_TYPE(type) (((type) == GLB_UART_SIG_FUN_UART0_RTS) || \
                                        ((type) == GLB_UART_SIG_FUN_UART0_CTS) || \
                                        ((type) == GLB_UART_SIG_FUN_UART0_TXD) || \
                                        ((type) == GLB_UART_SIG_FUN_UART0_RXD) || \
                                        ((type) == GLB_UART_SIG_FUN_UART1_RTS) || \
                                        ((type) == GLB_UART_SIG_FUN_UART1_CTS) || \
                                        ((type) == GLB_UART_SIG_FUN_UART1_TXD) || \
                                        ((type) == GLB_UART_SIG_FUN_UART1_RXD) || \
                                        ((type) == GLB_UART_SIG_FUN_UART2_RTS) || \
                                        ((type) == GLB_UART_SIG_FUN_UART2_CTS) || \
                                        ((type) == GLB_UART_SIG_FUN_UART2_TXD) || \
                                        ((type) == GLB_UART_SIG_FUN_UART2_RXD))

