RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/bl808_glb.h
/** @defgroup  GLB_XTAL_TYPE
 *  @{
 */
#define IS_GLB_XTAL_TYPE(type) (((type) == GLB_XTAL_NONE) ||  \
                                ((type) == GLB_XTAL_24M) ||   \
                                ((type) == GLB_XTAL_32M) ||   \
                                ((type) == GLB_XTAL_38P4M) || \
                                ((type) == GLB_XTAL_40M) ||   \
                                ((type) == GLB_XTAL_26M) ||   \
                                ((type) == GLB_XTAL_RC32M) || \
                                ((type) == GLB_XTAL_MAX))

/** @defgroup  GLB_PLL_TYPE
 *  @{
 */
#define IS_GLB_PLL_TYPE(type) (((type) == GLB_PLL_NONE) ||    \
                               ((type) == GLB_PLL_WIFIPLL) || \
                               ((type) == GLB_PLL_AUPLL) ||   \
                               ((type) == GLB_PLL_CPUPLL) ||  \
                               ((type) == GLB_PLL_MIPIPLL) || \
                               ((type) == GLB_PLL_UHSPLL))

/** @defgroup  GLB_WAC_PLL_TYPE
 *  @{
 */
#define IS_GLB_WAC_PLL_TYPE(type) (((type) == GLB_WAC_PLL_WIFIPLL) || \
                                   ((type) == GLB_WAC_PLL_AUPLL) ||   \
                                   ((type) == GLB_WAC_PLL_CPUPLL))

/** @defgroup  GLB_MU_PLL_TYPE
 *  @{
 */
#define IS_GLB_MU_PLL_TYPE(type) (((type) == GLB_MU_PLL_MIPIPLL) || \
                                  ((type) == GLB_MU_PLL_UHSPLL))

/** @defgroup  GLB_DISP_CLK_TYPE
 *  @{
 */
#define IS_GLB_DISP_CLK_TYPE(type) (((type) == GLB_DISP_CLK_MIPIPLL_1500M))

/** @defgroup  GLB_PSRAM_PLL_TYPE
 *  @{
 */
#define IS_GLB_PSRAM_PLL_TYPE(type) (((type) == GLB_PSRAM_EMI_CPUPLL_400M) ||  \
                                     ((type) == GLB_PSRAM_EMI_WIFIPLL_320M) || \
                                     ((type) == GLB_PSRAM_EMI_AUPLL_DIV1))

/** @defgroup  GLB_DSP_XCLK_TYPE
 *  @{
 */
#define IS_GLB_DSP_XCLK_TYPE(type) (((type) == GLB_DSP_XCLK_RC32M) || \
                                    ((type) == GLB_DSP_XCLK_XTAL))

/** @defgroup  GLB_DSP_ROOT_CLK_TYPE
 *  @{
 */
#define IS_GLB_DSP_ROOT_CLK_TYPE(type) (((type) == GLB_DSP_ROOT_CLK_XCLK) || \
                                        ((type) == GLB_DSP_ROOT_CLK_PLL))

/** @defgroup  GLB_DSP_PBROOT_CLK_TYPE
 *  @{
 */
#define IS_GLB_DSP_PBROOT_CLK_TYPE(type) (((type) == GLB_DSP_PBROOT_CLK_MM_XCLK) ||        \
                                          ((type) == GLB_DSP_PBROOT_CLK_MM_MUXPLL_240M) || \
                                          ((type) == GLB_DSP_PBROOT_CLK_MM_MUXPLL_160M))

/** @defgroup  GLB_DSP_PLL_CLK_TYPE
 *  @{
 */
#define IS_GLB_DSP_PLL_CLK_TYPE(type) (((type) == GLB_DSP_PLL_CLK_MUXPLL_240M) || \
                                       ((type) == GLB_DSP_PLL_CLK_MUXPLL_320M) || \
                                       ((type) == GLB_DSP_PLL_CLK_CPUPLL_400M))

/** @defgroup  GLB_DSP_UART_CLK_TYPE
 *  @{
 */
#define IS_GLB_DSP_UART_CLK_TYPE(type) (((type) == GLB_DSP_UART_CLK_DSP_PBCLK) ||   \
                                        ((type) == GLB_DSP_UART_CLK_MUXPLL_160M) || \
                                        ((type) == GLB_DSP_UART_CLK_DSP_XCLK))

/** @defgroup  GLB_UART_CLK_TYPE
 *  @{
 */
#define IS_GLB_UART_CLK_TYPE(type) (((type) == GLB_UART_CLK_BCLK) || \
                                    ((type) == GLB_UART_CLK_PLL_160M))

/** @defgroup  GLB_DSP_CNN_CLK_TYPE
 *  @{
 */
#define IS_GLB_DSP_CNN_CLK_TYPE(type) (((type) == GLB_DSP_CNN_CLK_160M) || \
                                       ((type) == GLB_DSP_CNN_CLK_240M) || \
                                       ((type) == GLB_DSP_CNN_CLK_320M))

/** @defgroup  GLB_DSP_DP_CLK_TYPE
 *  @{
 */
#define IS_GLB_DSP_DP_CLK_TYPE(type) (((type) == GLB_DSP_DP_CLK_DISPLAY_PLL) || \
                                      ((type) == GLB_DSP_DP_CLK_DSP_XCLK))

/** @defgroup  GLB_DSP_CLK_TYPE
 *  @{
 */
#define IS_GLB_DSP_CLK_TYPE(type) (((type) == GLB_DSP_CLK_MUXPLL_160M) || \
                                       ((type) == GLB_DSP_CLK_MUXPLL_240M) || \
                                       ((type) == GLB_DSP_CLK_CPUPLL_400M) || \
                                       ((type) == GLB_DSP_CLK_DSP_XCLK))

/** @defgroup  GLB_DSP_H264_CLK_TYPE
 *  @{
 */
#define IS_GLB_DSP_H264_CLK_TYPE(type) (((type) == GLB_DSP_H264_DSP_MUXPLL_160M) || \
                                        ((type) == GLB_DSP_H264_DSP_MUXPLL_240M) || \
                                        ((type) == GLB_DSP_H264_DSP_MUXPLL_320M))

/** @defgroup  GLB_DSP_SPI_CLK_TYPE
 *  @{
 */
#define IS_GLB_DSP_SPI_CLK_TYPE(type) (((type) == GLB_DSP_SPI_CLK_DSP_MUXPLL_160M) || \
                                       ((type) == GLB_DSP_SPI_CLK_DSP_XCLK))

/** @defgroup  GLB_DSP_I2C_CLK_TYPE
 *  @{
 */
#define IS_GLB_DSP_I2C_CLK_TYPE(type) (((type) == GLB_DSP_I2C_CLK_DSP_PBCLK) || \
                                       ((type) == GLB_DSP_I2C_CLK_XCLK))

/** @defgroup  GLB_I2S_DI_REF_CLK_TYPE
 *  @{
 */
#define IS_GLB_I2S_DI_REF_CLK_TYPE(type) (((type) == GLB_I2S_DI_SEL_I2S_DI_INPUT) || \
                                          ((type) == GLB_I2S_DI_SEL_I2S_REF_OUTPUT))

/** @defgroup  GLB_I2S_DO_REF_CLK_TYPE
 *  @{
 */
#define IS_GLB_I2S_DO_REF_CLK_TYPE(type) (((type) == GLB_I2S_DO_SEL_I2S_DO_OUTPT) || \
                                          ((type) == GLB_I2S_DO_SEL_I2S_REF_OUTPUT))

/** @defgroup  GLB_EMI_CLK_TYPE
 *  @{
 */
#define IS_GLB_EMI_CLK_TYPE(type) (((type) == GLB_EMI_CLK_MCU_PBCLK) ||        \
                                   ((type) == GLB_EMI_CLK_CPUPLL_200M_CLK) ||  \
                                   ((type) == GLB_EMI_CLK_WIFIPLL_320M_CLK) || \
                                   ((type) == GLB_EMI_CLK_CPUPLL_400M_CLK))

/** @defgroup  GLB_DSP_SW_SYSTEM_TYPE
 *  @{
 */
#define IS_GLB_DSP_SW_SYSTEM_TYPE(type) (((type) == GLB_DSP_SW_SYSTEM_CTRL_SYS) ||   \
                                         ((type) == GLB_DSP_SW_SYSTEM_CTRL_PWRON) || \
                                         ((type) == GLB_DSP_SW_SYSTEM_CTRL_DSP0) ||  \
                                         ((type) == GLB_DSP_SW_SYSTEM_CTRL_DSP1) ||  \
                                         ((type) == GLB_DSP_SW_SYSTEM_CTRL_WL2MM))

/** @defgroup  GLB_DSP_PERIPHERAL_TYPE
 *  @{
 */
#define IS_GLB_DSP_PERIPHERAL_TYPE(type) (((type) == GLB_DSP_PERIPHERAL_MM_MISC) || \
                                          ((type) == GLB_DSP_PERIPHERAL_DMA) ||     \
                                          ((type) == GLB_DSP_PERIPHERAL_UART0) ||   \
                                          ((type) == GLB_DSP_PERIPHERAL_I2C0) ||    \
                                          ((type) == GLB_DSP_PERIPHERAL_IPC) ||     \
                                          ((type) == GLB_DSP_PERIPHERAL_SPI) ||     \
                                          ((type) == GLB_DSP_PERIPHERAL_TIMER) ||   \
                                          ((type) == GLB_DSP_PERIPHERAL_I2S0))

/** @defgroup  GLB_DSP_SUB_TYPE
 *  @{
 */
#define IS_GLB_DSP_SUB_TYPE(type) (((type) == GLB_DSP_SUB_MISC) || \
                                   ((type) == GLB_DSP_SUB_DVP2BUSA) || \
                                   ((type) == GLB_DSP_SUB_DVP2BUSB) || \
                                   ((type) == GLB_DSP_SUB_DVP2BUSC) || \
                                   ((type) == GLB_DSP_SUB_OSD_DRAW) || \
                                   ((type) == GLB_DSP_SUB_DP) ||       \
                                   ((type) == GLB_DSP_SUB_IMG_PR) ||   \
                                   ((type) == GLB_DSP_SUB_SCLRA) ||    \
                                   ((type) == GLB_DSP_SUB_SCLRB))

/** @defgroup  GLB_DSP_CODEC_SUB_TYPE
 *  @{
 */
#define IS_GLB_DSP_CODEC_SUB_TYPE(type) (((type) == GLB_DSP_CODEC_SUB_MJPEG) || \
                                         ((type) == GLB_DSP_CODEC_SUB_CNN) ||   \
                                         ((type) == GLB_DSP_CODEC_SUB_VRAM))

/** @defgroup  GLB_DSP_IMAGE_SENSOR_TYPE
 *  @{
 */
#define IS_GLB_DSP_IMAGE_SENSOR_TYPE(type) (((type) == GLB_DSP_IMAGE_SENSOR_RG_IS))

/** @defgroup  GLB_LDO15CIS_LEVEL_TYPE
 *  @{
 */
#define IS_GLB_LDO15CIS_LEVEL_TYPE(type) (((type) == GLB_LDO15CIS_LEVEL_1P00V) || \
                                          ((type) == GLB_LDO15CIS_LEVEL_1P05V) || \
                                          ((type) == GLB_LDO15CIS_LEVEL_1P10V) || \
                                          ((type) == GLB_LDO15CIS_LEVEL_1P15V) || \
                                          ((type) == GLB_LDO15CIS_LEVEL_1P20V) || \
                                          ((type) == GLB_LDO15CIS_LEVEL_1P30V) || \
                                          ((type) == GLB_LDO15CIS_LEVEL_1P40V) || \
                                          ((type) == GLB_LDO15CIS_LEVEL_1P45V) || \
                                          ((type) == GLB_LDO15CIS_LEVEL_1P50V) || \
                                          ((type) == GLB_LDO15CIS_LEVEL_1P55V) || \
                                          ((type) == GLB_LDO15CIS_LEVEL_1P60V) || \
                                          ((type) == GLB_LDO15CIS_LEVEL_1P65V) || \
                                          ((type) == GLB_LDO15CIS_LEVEL_1P70V) || \
                                          ((type) == GLB_LDO15CIS_LEVEL_1P75V) || \
                                          ((type) == GLB_LDO15CIS_LEVEL_1P80V) || \
                                          ((type) == GLB_LDO15CIS_LEVEL_1P85V))

/*@} end of group GLB_Public_Constants */

/** @defgroup  GLB_Public_Macros
 *  @{
 */
#define UART_SIG_SWAP_NONE          (0x00) /* uart_sig[0:11] -> uart_sig[0:11] */
#define UART_SIG_SWAP_GPIO0_GPIO11  (0x01) /* GPIO0-11  uart_sig[ 0:11] -> uart_sig[ 6:11], uart_sig[ 0: 5] */
#define UART_SIG_SWAP_GPIO12_GPIO23 (0x02) /* GPIO12-23 uart_sig[12:23] -> uart_sig[18:23], uart_sig[12:17] */
#define UART_SIG_SWAP_GPIO24_GPIO35 (0x04) /* GPIO24-35 uart_sig[24:35] -> uart_sig[30:35], uart_sig[24:29] */
#define UART_SIG_SWAP_GPIO36_GPIO47 (0x08) /* GPIO36-47 uart_sig[36:47] -> uart_sig[42:47], uart_sig[36:41] */

#define JTAG_SIG_SWAP_NONE 0x00 /* GPIO0-22  E21_TMS/E21_TDI/E21_TCK/E21_TDO <- E21_TCK/E21_TDO/E21_TMS/E21_TDI */

