RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/bl808_glb.h
#define GLB_AHB_CLOCK_CPU             (0x1ULL<<GLB_AHB_CLOCK_IP_CPU)
#define GLB_AHB_CLOCK_SDU             (0x1ULL<<GLB_AHB_CLOCK_IP_SDU)
#define GLB_AHB_CLOCK_SEC             (0x1ULL<<GLB_AHB_CLOCK_IP_SEC)
#define GLB_AHB_CLOCK_DMA_0           (0x1ULL<<GLB_AHB_CLOCK_IP_DMA_0)
#define GLB_AHB_CLOCK_DMA_1           (0x1ULL<<GLB_AHB_CLOCK_IP_DMA_1)
#define GLB_AHB_CLOCK_DMA_2           (0x1ULL<<GLB_AHB_CLOCK_IP_DMA_2)
#define GLB_AHB_CLOCK_CCI             (0x1ULL<<GLB_AHB_CLOCK_IP_CCI)
#define GLB_AHB_CLOCK_RF_TOP          (0x1ULL<<GLB_AHB_CLOCK_IP_RF_TOP)
#define GLB_AHB_CLOCK_GPIP            (0x1ULL<<GLB_AHB_CLOCK_IP_GPIP)
#define GLB_AHB_CLOCK_TZC             (0x1ULL<<GLB_AHB_CLOCK_IP_TZC)
#define GLB_AHB_CLOCK_EF_CTRL         (0x1ULL<<GLB_AHB_CLOCK_IP_EF_CTRL)
#define GLB_AHB_CLOCK_SF_CTRL         (0x1ULL<<GLB_AHB_CLOCK_IP_SF_CTRL)
#define GLB_AHB_CLOCK_EMAC            (0x1ULL<<GLB_AHB_CLOCK_IP_EMAC)
#define GLB_AHB_CLOCK_UART0           (0x1ULL<<GLB_AHB_CLOCK_IP_UART0)
#define GLB_AHB_CLOCK_UART1           (0x1ULL<<GLB_AHB_CLOCK_IP_UART1)
#define GLB_AHB_CLOCK_UART2           (0x1ULL<<GLB_AHB_CLOCK_IP_UART2)
#define GLB_AHB_CLOCK_UART3           (0x1ULL<<GLB_AHB_CLOCK_IP_UART3)
//#define GLB_AHB_CLOCK_UART4           (0x1ULL<<GLB_AHB_CLOCK_IP_UART4)
#define GLB_AHB_CLOCK_SPI             (0x1ULL<<GLB_AHB_CLOCK_IP_SPI)
#define GLB_AHB_CLOCK_I2C             (0x1ULL<<GLB_AHB_CLOCK_IP_I2C)
#define GLB_AHB_CLOCK_PWM             (0x1ULL<<GLB_AHB_CLOCK_IP_PWM)
#define GLB_AHB_CLOCK_TIMER           (0x1ULL<<GLB_AHB_CLOCK_IP_TIMER)
#define GLB_AHB_CLOCK_IR              (0x1ULL<<GLB_AHB_CLOCK_IP_IR)
#define GLB_AHB_CLOCK_CHECKSUM        (0x1ULL<<GLB_AHB_CLOCK_IP_CHECKSUM)
#define GLB_AHB_CLOCK_QDEC            (0x1ULL<<GLB_AHB_CLOCK_IP_QDEC)
#define GLB_AHB_CLOCK_KYS             (0x1ULL<<GLB_AHB_CLOCK_IP_KYS)
#define GLB_AHB_CLOCK_I2S             (0x1ULL<<GLB_AHB_CLOCK_IP_I2S)
#define GLB_AHB_CLOCK_USB11           (0x1ULL<<GLB_AHB_CLOCK_IP_USB11)
#define GLB_AHB_CLOCK_CAM             (0x1ULL<<GLB_AHB_CLOCK_IP_CAM)
#define GLB_AHB_CLOCK_MJPEG           (0x1ULL<<GLB_AHB_CLOCK_IP_MJPEG)
#define GLB_AHB_CLOCK_BT_BLE_NORMAL   (0x1ULL<<GLB_AHB_CLOCK_IP_BT_BLE_NORMAL)
#define GLB_AHB_CLOCK_BT_BLE_LP       (0x1ULL<<GLB_AHB_CLOCK_IP_BT_BLE_LP)
#define GLB_AHB_CLOCK_ZB_NORMAL       (0x1ULL<<GLB_AHB_CLOCK_IP_ZB_NORMAL)
#define GLB_AHB_CLOCK_ZB_LP           (0x1ULL<<GLB_AHB_CLOCK_IP_ZB_LP)
#define GLB_AHB_CLOCK_WIFI_NORMAL     (0x1ULL<<GLB_AHB_CLOCK_IP_WIFI_NORMAL)
#define GLB_AHB_CLOCK_WIFI_LP         (0x1ULL<<GLB_AHB_CLOCK_IP_WIFI_LP)
#define GLB_AHB_CLOCK_BT_BLE_2_NORMAL (0x1ULL<<GLB_AHB_CLOCK_IP_BT_BLE_2_NORMAL)
#define GLB_AHB_CLOCK_BT_BLE_2_LP     (0x1ULL<<GLB_AHB_CLOCK_IP_BT_BLE_2_LP)
#define GLB_AHB_CLOCK_EMI_MISC        (0x1ULL<<GLB_AHB_CLOCK_IP_EMI_MISC)
#define GLB_AHB_CLOCK_PSRAM0_CTRL     (0x1ULL<<GLB_AHB_CLOCK_IP_PSRAM0_CTRL)
#define GLB_AHB_CLOCK_PSRAM1_CTRL     (0x1ULL<<GLB_AHB_CLOCK_IP_PSRAM1_CTRL)
#define GLB_AHB_CLOCK_USB20           (0x1ULL<<GLB_AHB_CLOCK_IP_USB20)
#define GLB_AHB_CLOCK_MIX2            (0x1ULL<<GLB_AHB_CLOCK_IP_MIX2)
#define GLB_AHB_CLOCK_AUDIO           (0x1ULL<<GLB_AHB_CLOCK_IP_AUDIO)
#define GLB_AHB_CLOCK_SDH             (0x1ULL<<GLB_AHB_CLOCK_IP_SDH)
#define GLB_AHB_CLOCK_ZB_2_NORMAL     (0x1ULL<<GLB_AHB_CLOCK_IP_ZB2_NORMAL)
#define GLB_AHB_CLOCK_ZB_2_LP         (0x1ULL<<GLB_AHB_CLOCK_IP_ZB2_LP)
#define GLB_AHB_CLOCK_I2C1            (0x1ULL<<GLB_AHB_CLOCK_IP_I2C1)
#define GLB_AHB_CLOCK_WIFI_PHY        (0x1ULL<<GLB_AHB_CLOCK_IP_WIFI_PHY)
#define GLB_AHB_CLOCK_WIFI_MAC_PHY    (0x1ULL<<GLB_AHB_CLOCK_IP_WIFI_MAC_PHY)
#define GLB_AHB_CLOCK_WIFI_PLATFORM   (0x1ULL<<GLB_AHB_CLOCK_IP_WIFI_PLATFORM)
#define GLB_AHB_CLOCK_LZ4             (0x1ULL<<GLB_AHB_CLOCK_IP_LZ4)
#define GLB_AHB_CLOCK_AUPDM           (0x1ULL<<GLB_AHB_CLOCK_IP_AUPDM)
#define GLB_AHB_CLOCK_GAUGE           (0x1ULL<<GLB_AHB_CLOCK_IP_GAUGE)

#define GLB_AUTO_CALC_XTAL_FLAG_MASK  0x0000ff00
#define GLB_AUTO_CALC_XTAL_FLAG_VALUE 0x5800

extern const GLB_WAC_PLL_Cfg_Type wifiPllCfg_960M[GLB_XTAL_MAX];
extern const GLB_WAC_PLL_Cfg_Type audioPllCfg_442P368M[GLB_XTAL_MAX];
extern const GLB_WAC_PLL_Cfg_Type audioPllCfg_451P584M[GLB_XTAL_MAX];
extern const GLB_WAC_PLL_Cfg_Type cpuPllCfg_380M[GLB_XTAL_MAX];
extern const GLB_WAC_PLL_Cfg_Type cpuPllCfg_400M[GLB_XTAL_MAX];
extern const GLB_WAC_PLL_Cfg_Type cpuPllCfg_440M[GLB_XTAL_MAX];
extern const GLB_WAC_PLL_Cfg_Type cpuPllCfg_480M[GLB_XTAL_MAX];
extern const GLB_MU_PLL_Cfg_Type mipiPllCfg_1500M[GLB_XTAL_MAX];
extern const GLB_MU_PLL_Cfg_Type uhsPllCfg_2100M[GLB_XTAL_MAX];
extern const GLB_MU_PLL_Cfg_Type uhsPllCfg_1400M[GLB_XTAL_MAX];
extern const GLB_MU_PLL_Cfg_Type uhsPllCfg_1500M[GLB_XTAL_MAX];
extern const GLB_MU_PLL_Cfg_Type uhsPllCfg_1600M[GLB_XTAL_MAX];
extern const GLB_MU_PLL_Cfg_Type uhsPllCfg_400M[GLB_XTAL_MAX];
extern const GLB_MU_PLL_Cfg_Type uhsPllCfg_667M[GLB_XTAL_MAX];
extern const GLB_MU_PLL_Cfg_Type uhsPllCfg_800M[GLB_XTAL_MAX];
extern const GLB_MU_PLL_Cfg_Type uhsPllCfg_1066M[GLB_XTAL_MAX];
extern const GLB_MU_PLL_Cfg_Type uhsPllCfg_2000M[GLB_XTAL_MAX];

/*@} end of group GLB_Public_Macros */

/** @defgroup  GLB_Public_Functions
 *  @{
 */
/*----------*/
#ifndef BFLB_USE_HAL_DRIVER
void BMX_ERR_IRQHandler(void);
void BMX_TO_IRQHandler(void);
#endif
/*----------*/
BL_Err_Type GLB_Set_MCU_Muxpll_160M_Sel(GLB_MCU_MUXPLL_160M_CLK_SEL_Type clkSel);
GLB_MCU_MUXPLL_160M_CLK_SEL_Type GLB_Get_MCU_Muxpll_160M_Sel(void);
BL_Err_Type GLB_Set_MCU_Muxpll_80M_Sel(GLB_MCU_MUXPLL_80M_CLK_SEL_Type clkSel);
GLB_MCU_MUXPLL_80M_CLK_SEL_Type GLB_Get_MCU_Muxpll_80M_Sel(void);
BL_Err_Type GLB_Set_DSP_Muxpll_320M_Sel(GLB_DSP_MUXPLL_320M_CLK_SEL_Type clkSel);
GLB_DSP_MUXPLL_320M_CLK_SEL_Type GLB_Get_DSP_Muxpll_320M_Sel(void);
BL_Err_Type GLB_Set_DSP_Muxpll_240M_Sel(GLB_DSP_MUXPLL_240M_CLK_SEL_Type clkSel);
GLB_DSP_MUXPLL_240M_CLK_SEL_Type GLB_Get_DSP_Muxpll_240M_Sel(void);
BL_Err_Type GLB_Set_DSP_Muxpll_160M_Sel(GLB_DSP_MUXPLL_160M_CLK_SEL_Type clkSel);
GLB_DSP_MUXPLL_160M_CLK_SEL_Type GLB_Get_DSP_Muxpll_160M_Sel(void);
/*----------*/
BL_Err_Type GLB_Power_On_XTAL_And_PLL_CLK(GLB_XTAL_Type xtalType, GLB_PLL_Type pllPuType);
BL_Err_Type GLB_Power_Off_WAC_PLL(GLB_WAC_PLL_Type pllType);
BL_Err_Type GLB_WAC_PLL_Ref_Clk_Sel(GLB_WAC_PLL_Type pllType, GLB_PLL_REF_CLK_Type refClk);
BL_Err_Type GLB_Power_On_WAC_PLL(GLB_WAC_PLL_Type pllType, const GLB_WAC_PLL_Cfg_Type *const cfg, uint8_t waitStable);
BL_Err_Type GLB_Set_USB_CLK_From_WIFIPLL(uint8_t enable);
BL_Err_Type GLB_Power_Off_MU_PLL(GLB_MU_PLL_Type pllType);
BL_Err_Type GLB_MU_PLL_Ref_Clk_Sel(GLB_MU_PLL_Type pllType, GLB_PLL_REF_CLK_Type refClk);
BL_Err_Type GLB_Power_On_MU_PLL(GLB_MU_PLL_Type pllType, const GLB_MU_PLL_Cfg_Type *const cfg, uint8_t waitStable);
BL_Err_Type GLB_Set_Display_CLK(uint8_t enable, GLB_DISP_CLK_Type srcClk, uint8_t evenDiv);
BL_Err_Type GLB_Set_EMAC_CLK(uint8_t enable);
BL_Err_Type GLB_Output_EMAC_CLK(uint8_t gpio);
/*----------*/
BL_Err_Type GLB_Set_MCU_System_CLK_Div(uint8_t mcuClkDiv, uint8_t mcuPBclkDiv, uint8_t lpClkDiv);
BL_Err_Type GLB_Get_MCU_System_CLK_Div(uint8_t *mcuClkDiv, uint8_t *mcuPBclkDiv, uint8_t *lpClkDiv);
BL_Err_Type GLB_Set_MCU_System_CLK(GLB_MCU_SYS_CLK_Type clkFreq);
BL_Err_Type GLB_Set_System_CLK_Div(uint8_t hclkDiv,uint8_t bclkDiv);
/*----------*/
BL_Err_Type GLB_Set_DSP_System_CLK_Div(uint8_t dspClkDiv, uint8_t dspBclkDiv);
BL_Err_Type GLB_Get_DSP_System_CLK_Div(uint8_t *dspClkDiv, uint8_t *dspBclkDiv);
BL_Err_Type GLB_Set_DSP_System_CLK(GLB_DSP_SYS_CLK_Type clkFreq);
BL_Err_Type GLB_Set_DSP_PBCLK_Div(uint8_t dspPBclkDiv);
BL_Err_Type GLB_Get_DSP_PBCLK_Div(uint8_t *dspPBclkDiv);
BL_Err_Type GLB_Set_DSP_PBCLK(GLB_DSP_SYS_PBCLK_Type pbClkSel);
/*----------*/
BL_Err_Type GLB_DSP0_Clock_Enable(void);
BL_Err_Type GLB_DSP0_Clock_Disable(void);
GLB_DSP_XCLK_Type GLB_Get_DSP_XCLK_Sel(void);
BL_Err_Type GLB_Set_DSP_XCLK_Sel(GLB_DSP_XCLK_Type xclk);
GLB_DSP_ROOT_CLK_Type GLB_Get_DSP_ROOT_CLK_Sel(void);
BL_Err_Type GLB_Set_DSP_ROOT_CLK_Sel(GLB_DSP_ROOT_CLK_Type rootClk);
BL_Err_Type GLB_Set_DSP_MUXPLL_CLK_Sel(GLB_DSP_PLL_CLK_Type pllClk);
GLB_DSP_PBROOT_CLK_Type GLB_Get_DSP_PBROOT_CLK_Sel(void);
BL_Err_Type GLB_Set_DSP_PBROOT_CLK_Sel(GLB_DSP_PBROOT_CLK_Type pbrootClk);
/*----------*/
GLB_CORE_ID_Type GLB_Get_Core_Type(void);
BL_Err_Type GLB_Halt_CPU(GLB_CORE_ID_Type coreID);
BL_Err_Type GLB_Release_CPU(GLB_CORE_ID_Type coreID);
BL_Err_Type GLB_Set_CPU_Reset_Address(GLB_CORE_ID_Type coreID, uint32_t addr);
/*----------*/
BL_Sts_Type GLB_DSP_Get_MCU_IntStatus(GLB_MCU_ALL_INT_Type intType);
BL_Err_Type GLB_DSP_Set_MCU_IntMask(GLB_MCU_ALL_INT_Type intType, BL_Mask_Type intMask);
BL_Err_Type GLB_DSP_Clr_MCU_IntStatus(GLB_MCU_ALL_INT_Type intType);
BL_Err_Type GLB_DSP_Set_LP_IntEn(uint8_t enable, GLB_LP_ALL_INT_Type intType);
BL_Sts_Type GLB_DSP_Get_LP_IntStatus(GLB_LP_ALL_INT_Type intType);
BL_Sts_Type GLB_MCU_Get_DSP_IntStatus(GLB_DSP_ALL_INT_Type intType);
BL_Err_Type GLB_MCU_Set_DSP_IntMask(GLB_DSP_ALL_INT_Type intType, BL_Mask_Type intMask);
BL_Err_Type GLB_MCU_Clr_DSP_IntStatus(GLB_DSP_ALL_INT_Type intType);
/*----------*/
BL_Err_Type GLB_Set_EMI_CLK(uint8_t enable, GLB_EMI_CLK_Type clkSel, uint32_t div);
BL_Err_Type GLB_Clr_EMI_Reset_Gate(void);
BL_Err_Type GLB_Set_MCU_MTimer_CLK(uint8_t enable, uint16_t div, uint8_t rst);
BL_Err_Type GLB_Set_DSP_MTimer_CLK(uint8_t enable, uint16_t div, uint8_t rst);
BL_Err_Type GLB_Set_ADC_CLK(uint8_t enable, GLB_ADC_CLK_Type clkSel, uint8_t div);
BL_Err_Type GLB_Set_DMA_CLK(uint8_t enable, GLB_DMA_CLK_ID_Type clk);
BL_Err_Type GLB_Set_Peripheral_DMA_CN(GLB_PERI_DMA_Type peri, GLB_PERI_DMA_CN_SEL_Type cn);
BL_Err_Type GLB_Set_IR_CLK(uint8_t enable, GLB_IR_CLK_SRC_Type clkSel, uint8_t div);
BL_Err_Type GLB_IR_RX_GPIO_Sel(GLB_GPIO_Type gpio);
BL_Err_Type GLB_IR_LED_Driver_Enable(void);
BL_Err_Type GLB_IR_LED_Driver_Disable(void);
BL_Err_Type GLB_Set_UART2_IO_Sel(GLB_UART2_IO_SEL_Type ioType);
BL_Err_Type GLB_Set_UART_CLK(uint8_t enable, HBN_UART_CLK_Type clkSel, uint8_t div);
BL_Err_Type GLB_UART_Fun_Sel(GLB_UART_SIG_Type sig, GLB_UART_SIG_FUN_Type fun);
BL_Err_Type GLB_Set_SF_CLK(uint8_t enable, GLB_SFLASH_CLK_Type clkSel, uint8_t div);
BL_Err_Type GLB_Set_I2C_CLK(uint8_t enable, GLB_I2C_CLK_Type clkSel, uint8_t div);
BL_Err_Type GLB_Set_I2S_CLK(uint8_t refClkEn, uint8_t refClkDiv, GLB_I2S_DI_REF_CLK_Type inRef, GLB_I2S_DO_REF_CLK_Type outRef);
BL_Err_Type GLB_Set_SPI_CLK(uint8_t enable, GLB_SPI_CLK_Type clkSel, uint8_t div);
BL_Err_Type GLB_Set_PWM1_IO_Sel(GLB_PWM1_IO_SEL_Type ioSel);
BL_Err_Type GLB_Set_PWM2_IO_Sel(GLB_PWM2_IO_SEL_Type ioSel);
BL_Err_Type GLB_Set_PDM_IO_Sel(GLB_PDM_IO_SEL_Type ioSel);
/*----------*/
BL_Err_Type GLB_Set_DIG_CLK_Sel(GLB_DIG_CLK_Type clkSel);
BL_Err_Type GLB_Set_DIG_512K_CLK(uint8_t enable, uint8_t compensationEn, uint8_t div);
BL_Err_Type GLB_Set_DIG_32K_CLK(uint8_t enable, uint8_t compensationEn, uint16_t div);
BL_Err_Type GLB_Platform_Wakeup_PDS_Enable(uint8_t enable);
/*----------*/
BL_Err_Type GLB_Sel_MCU_TMR_GPIO_Clock(GLB_GPIO_Type gpioPin);
BL_Err_Type GLB_Sel_DSP_TMR_GPIO_Clock(GLB_GPIO_Type gpioPin);
BL_Err_Type GLB_Set_Chip_Clock_Out0_Sel(GLB_CHIP_CLK_OUT_0_Type clkOutType);
BL_Err_Type GLB_Set_Chip_Clock_Out1_Sel(GLB_CHIP_CLK_OUT_1_Type clkOutType);
BL_Err_Type GLB_Set_Chip_Clock_Out2_Sel(GLB_CHIP_CLK_OUT_2_Type clkOutType);
BL_Err_Type GLB_Set_Chip_Clock_Out3_Sel(GLB_CHIP_CLK_OUT_3_Type clkOutType);
BL_Err_Type GLB_Set_CSI_DSI_CLK_Sel(GLB_CSI_DSI_CLK_SEL_Type csiClkSel, GLB_CSI_DSI_CLK_SEL_Type dsiClkSel);
/*----------*/
BL_Err_Type GLB_BMX_TO_Init(BMX_TO_Cfg_Type *BmxCfg);
uint8_t GLB_Get_BMX_TO_Status(void);
BL_Err_Type GLB_Clr_BMX_TO_Status(void);
/*----------*/
BL_Err_Type GLB_Set_Audio_AUTO_CLK(uint8_t divEn);
BL_Err_Type GLB_Set_Audio_ADC_CLK(uint8_t enable, uint8_t div);
BL_Err_Type GLB_Set_Audio_DAC_CLK(uint8_t enable, uint8_t div);
BL_Err_Type GLB_Set_Audio_PDM_CLK(uint8_t enable, uint8_t div);
BL_Err_Type GLB_Set_PADC_CLK(uint8_t enable, uint16_t div);
/*----------*/
BL_Err_Type GLB_Invert_ETH_RX_CLK(uint8_t enable);
BL_Err_Type GLB_Invert_ETH_TX_CLK(uint8_t enable);
BL_Err_Type GLB_Invert_ETH_REF_O_CLK(uint8_t enable);
BL_Err_Type GLB_Set_ETH_REF_O_CLK_Sel(GLB_ETH_REF_CLK_OUT_Type clkSel);
/*----------*/
BL_Err_Type GLB_Set_CAM_CLK(uint8_t enable, GLB_CAM_CLK_Type clkSel, uint8_t div);
BL_Err_Type GLB_Set_SDH_CLK(uint8_t enable, GLB_SDH_CLK_Type clkSel, uint8_t div);
/*----------*/
BL_Err_Type GLB_UART_Sig_Swap_Set(GLB_UART_SIG_SWAP_GRP_Type group, uint8_t swap);
BL_Err_Type GLB_Swap_DSP_SPI_0_MOSI_With_MISO(BL_Fun_Type newState);
BL_Err_Type GLB_Set_DSP_SPI_0_ACT_MOD_Sel(GLB_SPI_PAD_ACT_AS_Type mod);
BL_Err_Type GLB_Set_DSP_L2SRAM_Available_Size(uint8_t h2pfSramRel, uint8_t vramSramRel, uint8_t subSramRel, uint8_t blaiSramRel);
BL_Err_Type GLB_Swap_MCU_SPI_0_MOSI_With_MISO(BL_Fun_Type newState);
BL_Err_Type GLB_Set_MCU_SPI_0_ACT_MOD_Sel(GLB_SPI_PAD_ACT_AS_Type mod);
BL_Err_Type GLB_Set_Flash_IO_PARM(uint8_t selEmbedded, uint8_t swap);
/*----------*/
BL_Err_Type GLB_AHB_MCU_Software_Reset(GLB_AHB_MCU_SW_Type swrst);
BL_Err_Type GLB_AHB_DSP_Software_Reset(GLB_AHB_DSP_SW_Type swrst);
BL_Err_Type GLB_PER_Clock_Gate(uint64_t ips);
BL_Err_Type GLB_PER_Clock_UnGate(uint64_t ips);
BL_Err_Type GLB_PSRAM_PER_Clock_Gate(void);
BL_Err_Type GLB_PSRAM_PER_Clock_UnGate(void);
BL_Err_Type GLB_PLL_CGEN_Clock_Gate(GLB_PLL_CGEN_Type clk);
BL_Err_Type GLB_PLL_CGEN_Clock_UnGate(GLB_PLL_CGEN_Type clk);
BL_Err_Type GLB_Set_PKA_CLK_Sel(GLB_PKA_CLK_Type clkSel);
BL_Err_Type GLB_MCU_SW_System_Reset(GLB_MCU_SW_SYSTEM_Type sysPart);
BL_Err_Type GLB_SW_System_Reset(void);
BL_Err_Type GLB_SW_CPU_Reset(void);
BL_Err_Type GLB_SW_POR_Reset(void);
BL_Err_Type GLB_Disrst_Set(uint8_t enable, GLB_DISRST_Type disrst);
/*----------*/
BL_Err_Type GLB_Set_Auto_Calc_Xtal_Type(GLB_XTAL_Type calcXtalType);
BL_Err_Type GLB_Get_Auto_Calc_Xtal_Type(GLB_XTAL_Type *calcXtalType);
BL_Err_Type GLB_Set_Flash_Id_Value(uint32_t idValue);
uint32_t GLB_Get_Flash_Id_Value(void);
/*----------*/
BL_Err_Type GLB_Set_SRAM_RET(uint32_t value);
uint32_t GLB_Get_SRAM_RET(void);
BL_Err_Type GLB_Set_SRAM_SLP(uint32_t value);
uint32_t GLB_Get_SRAM_SLP(void);
BL_Err_Type GLB_Set_SRAM_PARM(uint32_t value);
uint32_t GLB_Get_SRAM_PARM(void);
BL_Err_Type GLB_Set_EM_Sel(GLB_EM_Type emType);
/*----------*/
BL_Err_Type GLB_Set_PSram_CLK(uint8_t id, uint8_t enable, GLB_PSRAM_PLL_Type pll, uint8_t div);
BL_Err_Type GLB_Trim_LDO18IO_Vout(void);
BL_Err_Type GLB_Trim_LDO18FLASH_Vout(void);
/*----------*/
BL_Err_Type GLB_Set_DSP_CNN_CLK(uint8_t enable, GLB_DSP_CNN_CLK_Type clkSel, uint8_t div);
BL_Err_Type GLB_Set_DSP_DP_CLK(uint8_t enable, GLB_DSP_DP_CLK_Type clkSel, uint8_t div);
BL_Err_Type GLB_Set_DSP_CLK(uint8_t enable, GLB_DSP_CLK_Type clkSel, uint8_t div);
BL_Err_Type GLB_Set_DSP_H264_CLK(uint8_t enable, GLB_DSP_H264_CLK_Type clkSel, uint8_t div);
BL_Err_Type GLB_Set_DSP_SPI_CLK(uint8_t enable, GLB_DSP_SPI_CLK_Type clkSel, uint8_t div);
BL_Err_Type GLB_Set_DSP_UART0_CLK(uint8_t enable, GLB_DSP_UART_CLK_Type uartClk, uint8_t div);
BL_Err_Type GLB_Set_DSP_UART1_CLK(uint8_t enable, GLB_DSP_UART_CLK_Type uartClk, uint8_t div);
BL_Err_Type GLB_Set_DSP_I2C0_CLK(uint8_t enable, GLB_DSP_I2C_CLK_Type clkSel, uint8_t divEn, uint8_t div);
BL_Err_Type GLB_Set_DSP_I2C1_CLK(uint8_t enable, GLB_DSP_I2C_CLK_Type clkSel, uint8_t divEn, uint8_t div);
/*----------*/
BL_Err_Type GLB_DSP_SW_System_Reset(GLB_DSP_SW_SYSTEM_Type sysPart);
BL_Err_Type GLB_DSP_Peripheral_Reset(GLB_DSP_PERIPHERAL_Type periPart);
BL_Err_Type GLB_DSP_Sub_Reset(GLB_DSP_SUB_Type subPart);
BL_Err_Type GLB_DSP_Codec_Sub_Reset(GLB_DSP_CODEC_SUB_Type codecPart);
BL_Err_Type GLB_DSP_Image_Sensor_Reset(GLB_DSP_IMAGE_SENSOR_Type imageSensorPart);
/*----------*/
BL_Err_Type GLB_Config_WIFI_PLL(GLB_XTAL_Type xtalType, const GLB_WAC_PLL_Cfg_Type * pllCfgList);
BL_Err_Type GLB_Config_AUDIO_PLL(GLB_XTAL_Type xtalType, const GLB_WAC_PLL_Cfg_Type * pllCfgList);
BL_Err_Type GLB_Config_CPU_PLL(GLB_XTAL_Type xtalType, const GLB_WAC_PLL_Cfg_Type * pllCfgList);
BL_Err_Type GLB_Config_MIPI_PLL(GLB_XTAL_Type xtalType, const GLB_MU_PLL_Cfg_Type * pllCfgList);
BL_Err_Type GLB_Config_MIPI_PLL_Div(uint8_t divEn, uint8_t divRatio);
BL_Err_Type GLB_Config_UHS_PLL(GLB_XTAL_Type xtalType, const GLB_MU_PLL_Cfg_Type * pllCfgList);
/*----------*/
BL_Err_Type GLB_Set_Ldo15cis_Vout(GLB_LDO15CIS_LEVEL_Type ldoLevel);
BL_Err_Type GLB_CSI_Config_MIPIPLL(uint8_t postDivSel, uint32_t sdmin);
BL_Err_Type GLB_CSI_Power_Up_MIPIPLL(void);
/*----------*/;

/*@} end of group GLB_Public_Functions */

/*@} end of group GLB */

/*@} end of group BL808_Peripheral_Driver */

#endif /* __BL808_GLB_H__ */
